{
    "AIP 97": "Individual placements for field learning. Must be integrated with an academic discipline. A written contract involving all parties will include learning objectives, a paper/project outline, and means of supervision and progress evaluation. May be taken for credit up to three times. Prerequisites: lower-division standing, completion of thirty units of UC San Diego undergraduate study, a minimum UC San Diego GPA of 3.0, and a completed and approved Learning Agreement for Special Studies.",
    "AIP 197": "Individual internship placements integrated with an academic discipline. A written contract involving all parties will include learning objectives, a paper/project outline, and means of supervision and progress evaluation. Consent of faculty adviser and program chair required. May be taken for credit up to three times for a maximum of sixteen units. Prerequisites: upper-division standing; department approval.",
    "AIP 197DC": "This internship is attached to the University of California, Washington Center programs. Students participating in the campus UCDC program secure internships in the Washington, DC area requiring 18–30 hours per week. Students must be enrolled in the UCDC program. Prerequisites: upper-division standing; department approval.",
    "AIP 197P": "Individual placements for field learning associated with UC San Diego partnerships and special programs. A written contract involving all parties will include learning objectives, a paper/project outline, and means of supervision and progress evaluation. Consent of faculty adviser and program chair required. Prerequisites: ninety units minimum completed; 2.5 minimum cumulative GPA; department approval.",
    "BENG 1": "An introduction to bioengineering that includes lectures and hands-on laboratory for design projects. The principles of problem definition, engineering inventiveness, team design, prototyping, and testing, as well as information access, engineering standards, communication, ethics, and social responsibility will be emphasized. P/NP grades only. Prerequisites: none. (W)",
    "BENG 2": "Introduction to MATLAB is designed to give students fluency in MATLAB, including popular toolboxes. Consists of interactive lectures with a computer running MATLAB for each student. Topics: variables, operations, and plotting; visualization and programming; and solving equations and curve fitting. Prerequisites: bioengineering: biosystems majors only or consent of department. (F)",
    "BIOM 200A": "This course provides a systematic approach to current biomedical research, using analysis of selected topics to focus on the process of research discovery and its critical evaluation. The course progresses through five thematic modules that cover genes, building a cell, cellular responses, organogenesis, and the processes that allow survival in the world. Prerequisites: limited to BMS graduate students except by consent of instructor.",
    "BIOM 200B": "Students will critically evaluate classic and current research papers in biomedical research, in addition to being exposed to state-of-the-art technologies in research. Prerequisites: limited to BMS graduate students except by consent of instructor.",
    "BIOM 201": "This course includes attendance at seminars in the biomedical sciences and is designed to provoke critical discussion of the presented findings and scientific approaches in a small-group setting. Prerequisites: limited to BMS graduate students except by consent of instructor.",
    "BIOM 202": "Laboratory rotations provide first-year students with experience in the various experimental methods used in biomedical sciences. Prerequisites: limited to BMS graduate students except by consent of instructor. (F,W,S)",
    "BIOM 209": "Overview of new systems biology “omics” approaches to lipid metabolism and cell signaling including interrogating gene and lipid databases, techniques for lipidomics, and implications for profiling and biomarker discovery in blood and tissues relevant to inflammatory and other human diseases. Recommended: one quarter of undergraduate biochemistry. Prerequisites: none.",
    "BIOM 218": "Participation in the symposia held by CARTA three times a year. Students shadow one of the speakers during public and private symposia. Students meet after each symposium and each writes a summary of the speaker’s presentation and ensuring discussion. Prerequisites: graduate standing required.",
    "BIOM 219": "Overview of ethical issues in scientific research, conflicts of interest; national, statewide and campus issues and requirement; ethical issues in publications; authorship; retention of research records; tracing of research records; attribution; plagiarism; copyright considerations; primary, archival and meeting summary publications; ethical procedures and policies; NIH, NSF, California and UC San Diego; case studies and precedents in ethics. Prerequisites: consent of instructor.",
    "CHIN 10AN": "Introductory Mandarin Chinese language course for students with no Chinese language experience. Part one of a three-quarter sequence that covers foundational pronunciation, grammar, and vocabulary through interactive classes. Prerequisites: placement interview required for department approval to enroll.",
    "CHIN 10AM": "Introductory Mandarin Chinese language course intended for students with some oral proficiency but who have not had formal written training in Mandarin. Part one of a three-quarter sequence focusing on increasing literacy with basic characters and covering fundamentals of Chinese grammar, pronunciation, and vocabulary through interactive classes. Prerequisites: placement interview required for department approval to enroll.",
    "CHIN 10AD": "Introductory Mandarin Chinese language course intended for students with some proficiency in a Chinese dialect other than Mandarin. Part one of a three-quarter sequence covering fundamentals of pronunciation, Chinese grammar, and vocabulary through interactive classes. Prerequisites: placement interview required for department approval to enroll.",
    "CHIN 10BN": "Introductory Mandarin Chinese language course for students with little to no Chinese language experience. Part two of a three-quarter sequence that covers foundational pronunciation, grammar, and vocabulary through interactive classes. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 10BM": "Introductory Mandarin Chinese language course intended for students with some oral proficiency but who have not had significant written training in Mandarin; part two of a three-quarter sequence focusing on increasing literacy with additional characters. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 10BD": "Introductory Mandarin Chinese language course intended for students with some proficiency in a Chinese dialect other than Mandarin. Part two of a three-quarter sequence that expands competence in Chinese grammar, pronunciation, and vocabulary through interactive classes. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 10CN": "Introductory Mandarin Chinese language course for students with some basic Chinese language experience. Part three of a three-quarter sequence that covers foundational pronunciation, grammar, and vocabulary through interactive classes. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 10CM": "Introductory Mandarin Chinese language course intended for students with some oral proficiency but who have not had significant written training in Mandarin. Part three of a three-quarter sequence focusing on increasing literacy with additional characters and expanding competence in Chinese grammar, pronunciation, and vocabulary through interactive classes. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 10CD": "Introductory Mandarin Chinese language course intended for students with some proficiency in a Chinese dialect other than Mandarin. Part three of a three-quarter sequence that expands competence in Chinese grammar, pronunciation, and vocabulary through interactive classes. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 20AN": "Intermediate Mandarin Chinese language course for students with some basic formal study of Chinese language; part one of a three-quarter sequence that continues to expand oral and written communicative competence in Mandarin Chinese through interactive classes. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 20AM": "Intermediate Mandarin Chinese language course intended for students with some oral proficiency but little formal written training in Mandarin; part one of a three-quarter sequence focusing on increasing literacy with additional characters and expanding oral and written communicative competence in Mandarin Chinese through interactive classes. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 20AD": "Intermediate Mandarin Chinese language course intended for students with some proficiency in a Chinese dialect other than Mandarin; part one of a three-quarter sequence that continues to expand oral and written communicative competence in Mandarin Chinese through interactive classes. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 20BN": "Intermediate Mandarin Chinese language course for students with some basic formal study of Chinese language; part two of a three-quarter sequence that continues to expand oral and written communicative competence in Mandarin Chinese through interactive classes. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 20BM": "Intermediate Mandarin Chinese language course intended for students with some proficiency in a Chinese dialect other than Mandarin; part two of a three-quarter sequence that continues to expand oral and written communicative competence in Mandarin Chinese through interactive classes. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 20BD": "Intermediate Mandarin Chinese language course for students with some basic formal study of Chinese language; part three of a three-quarter sequence that continues to expand oral and written communicative competence in Mandarin Chinese through interactive classes. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 20CN": "Intermediate Mandarin Chinese language course intended for students with some oral proficiency but little formal written training in Mandarin; part three of a three-quarter sequence focusing on increasing literacy with additional characters and expanding oral and written communicative competence in Mandarin Chinese through interactive classes. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 20CM": "Intermediate Mandarin Chinese language course intended for students with some proficiency in a Chinese dialect other than Mandarin; part three of a three-quarter sequence that continues to expand oral and written communicative competence in Mandarin Chinese through interactive classes. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 20CD": "Advanced Mandarin Chinese language course for students who have received some prior formal training in Mandarin. Part one of a three-quarter sequence that further expands more advanced oral and written communicative competence through study of topics including the history of Chinese language and society, education, and literature. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 100AN": "Advanced Mandarin Chinese language course for students who have received some prior formal training in Mandarin. Part one of a three-quarter sequence that further expands more advanced oral and written communicative competence through study of topics including the history of Chinese language and society, education, and literature. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 100AM": "Advanced Mandarin Chinese language course for students who have received some prior training in Mandarin. Part two of a three-quarter sequence that further expands more advanced oral and written communicative competence through study of topics including the history of Chinese language and society, education, and literature. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 100BN": "Advanced Mandarin Chinese language course intended for students with some oral or written proficiency in Mandarin or another Chinese dialect. Part two of a three-quarter sequence that further expands more complex oral and written communicative competence through study of topics including the history of Chinese language and society, education, and literature. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 100BM": "Advanced Mandarin Chinese language course for students who have received some prior training in Mandarin. Part three of a three-quarter sequence that further expands more advanced oral and written communicative competence through study of topics including the history of Chinese language and society, education, and literature. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 100CN": "Advanced Mandarin Chinese language course intended for students with some oral or written proficiency in Mandarin or another Chinese dialect. Part three of a three-quarter sequence that further expands more complex oral and written communicative competence through study of topics including the history of Chinese language and society, education, and literature. Prerequisites: previous course or department approval through placement interview.",
    "CHIN 100CM": "This course introduces the primary sources used by historians of late Imperial and twentieth-century Chinese history. Reading material includes diaries, newspaper articles, Qing documents, gazetteers, essays, speeches, popular fiction, journal articles, scholarly prose, and field surveys. May be repeated for credit. (P/NP grades only.) Prerequisites: advanced knowledge of Chinese language and consent of instructor.",
    "CCS 101": "The University of California-wide goals of the Carbon Neutrality Initiative are introduced through a series of modules where students learn basic principles of carbon neutrality, participate in seminars with campus operations staff, and tour relevant campus infrastructure including the UC San Diego microgrid, Leadership in Energy and Environmental Design (LEED) certified buildings, and sustainable transportation efforts. Prerequisites: upper-division standing. ",
    "CCS 102": "This course introduces students to exciting and current research topics related to climate change as presented by faculty and researchers across UC San Diego. The course is offered as a series of reading topics followed by seminars on original research presented by faculty and researchers. Prerequisites: upper-division standing.",
    "CCS 123": "Climate change has forced decision makers in the public and private sectors to develop and adopt policies to help facilitate a transition to a clean energy economy and avoid some of the worst consequences of climate change. In this course we will discuss state, federal, and international policies related to climate change. The political context in which these policy responses have developed, and in which they will continue to evolve, will be emphasized throughout. Prerequisites: upper-division standing.",
    "CCS 197": "A campus-based internship, typically designed by the student, that will help the university meet our stated carbon neutrality goals. The project can be developed either individually or as part of a team. A written contract involving all parties will include learning objectives, a paper or project outline, and means of supervision and progress evaluation. May be taken for credit up to three times for a maximum of eight units. P/NP grades only. Prerequisites: CCS 101, CCS 102, and department approval.",
    "CCS 199": "Independent reading or research on a topic related to climate change by special arrangement with a faculty member. May be taken for credit up to three times for a maximum of eight units. P/NP grades only. Prerequisites: CCS 101, CCS 102, and department approval.",
    "CLRE 230": "This course covers how to develop and implement a digital strategy to drive a health research organization’s online presence, specifically the processes for selecting, using, managing, and evaluating the effectiveness of web, social media, and mobile technologies. Prerequisites: admission to the MAS Clinical Research Program or consent of department.",
    "CLRE 231": "The goal of implementation science is to ensure that the knowledge and materials produced by health research actually leads to improved population health by: 1) reaching the people for whom they are intended; 2) being adapted to local circumstances; and 3) being implemented effectively, safely, equitably, and in a timely and patient-centered manner. Prerequisites: admission to the MAS Clinical Research Program or consent of department.",
    "CLRE 232": "This course provides skills in designing and carrying out a qualitative study useful for program management (planning, monitoring, and evaluation) and ensuring quality in health-care delivery. The methods included in the course are a sample of commonly used qualitative methods: structured and unstructured interviews, participatory learning methods, group and individual methods. Prerequisites: admission to the MAS Clinical Research Program or consent of department.",
    "CLRE 233": "This course provides students with a strong foundation in regulatory science and drug device development and a hands-on introduction to current good manufacturing, laboratory and clinical practices, as well as product development. It offers graduates unique instruction for the specialized jobs in regulatory science in federal, academic, and industry work settings. Prerequisites: admission to the MAS Clinical Research Program or consent of department.",
    "CLRE 234": "This course will provide an overview of Institutional Review Board (IRB) considerations of social media in research, including those major ethical challenges and data security issues that may arise with the use of social media for recruitment, consent processes, data collection, and data dissemination. Prerequisites: admission to the MAS Clinical Research Program or consent of department.",
    "CLRE 235": "This course offers practical guidance about how best to engage in interdisciplinary and multidisciplinary team science: to pursue complex science questions, to work effectively with team members, and to produce high impact research outcomes that help meet society’s needs. Prerequisites: admission to the MAS Clinical Research Program or consent of department.",
    "CLRE 236": "Students learn principles and practices of translational medicine applied to discovery and development of drugs, devices, and diagnostics. Topics covered include biomarkers, intellectual property, omics, translational imaging, pharmacogenomics-driven treatment, and discovery and development of diagnostics, stem cell therapies, and drugs. Prerequisites: admission to the MAS Clinical Research Program or consent of department.",
    "CLRE 236R": "Students will learn about the application of translational science principles and tools to accelerate and improve the efficiency and effectiveness of the discovery/design and development of biomedical products—from drugs/biologics and cell and gene therapy to medical technology. Prerequisites: admission to the MAS Clinical Research Program or consent of department.",
    "CLRE 237": "This course covers the basics of regenerative medicine for understanding what stem cell-targeted therapy is and what are the principles for taking a cell-based product from preclinical to first-in-human clinical studies. Topics covered include the regulatory, ethical, and study design considerations for developing stem cell-targeted therapies. Students will grasp the complexities of stem cell-targeted therapies and be able to understand the framework for developing new products. This course provides a good overview for those entering a field that may deliver stem cell therapies, stem cell-targeted treatments, or other cellular based therapies (e.g., car-t-cell).  Prerequisites: admission to the MAS Clinical Research Program or consent of department.",
    "CLRE 238": "Students will gain a comprehensive and integrative operational understanding of an entire life science innovation cycle, from drug idea to market and back, through case studies done by mining publicly disclosed information in teams mentored by biopharmaceutical professionals. Prerequisites: CLRE 236 and admission to the MAS Clinical Research Program or consent of department.",
    "CLRE 238R": "Students will gain a real-world, comprehensive, and integrative understanding of an entire health innovation cycle, from ideation to commercialization of a biomedical product, through a case study. Prerequisites: CLRE 236 or CLRE 236R and admission to the MAS in Clinical Research Program or consent of department.",
    "CLRE 239": "Building upon the case studies laid out in Applied Translational Research (CLRE 238), this course will analyze in depth specific issues by emulating the biomedical industry modus operandi. Mentored student teams will analyze publicly available information, develop a business case, and defend it in front of a jury of biomedical industry research and development (R&D) leaders. In the process, students will learn and apply teamwork and brainstorming techniques and tools. Prerequisites: CLRE 238 and admission to the MAS Clinical Research Program or consent of department.",
    "CLRE 250": "This course will develop and apply the theory of clinical trials design and analysis, discuss the practical issues of financing and implementing clinical trials, and describe issues of monitoring trials and working in cooperative groups. The scholar will design and present a prospective clinical study protocol and participate in peer review of their colleagues’ work. Prerequisites: admission to the MAS in Clinical Research Program or consent of department.",
    "CLRE 250R": "This course will develop and apply the theory of clinical trials design and analysis, discuss the practical issues of financing and implementing clinical studies, and describe issues of monitoring trials/studies and working in cooperative groups. The scholar will design and present a prospective clinical study protocol and participate in peer review of their colleagues’ work. Prerequisites: admission to the MAS in Clinical Research Program or consent of department.",
    "CSE 3": "Introduces the concepts and skills necessary to effectively use information technology. Includes basic concepts and some practical skills with computer and networks. Prerequisites: none.",
    "CSE 4GS": "Exploration of topics in mathematics and engineering as they relate to classical architecture in Rome, Italy. In depth geometrical analysis and computer modeling of basic structures (arches, vaults, domes), and on-site studies of the Colosseum, Pantheon, Roman Forum, and St. Peter’s Basilica. Prerequisites: MATH 10A or MATH 20A; department approval, and corequisite of CSE 6GS.",
    "CSE 6GS": "Companion course to CSE 4GS where theory is applied and lab experiments are carried out “in the field” in Rome, Italy. For final projects, students will select a complex structure (e.g., the Colosseum, the Pantheon, St. Peter’s, etc.) to analyze and model, in detail, using computer-based tools. Prerequisites: MATH 10A or MATH 20A; department approval, and corequisite of CSE 4GS.",
    "CAT 1": "Lower-division composition course teaching critical reading and drafting by examining how culture, art, and technology have intersected in the past. Prerequisites: Sixth College students only; completion of UC Entry Level Writing Requirement.",
    "CAT 2": "Lower-division writing-intensive course foregrounding argumentation, revision, and writing as process by examining case studies of culture, art, and technology interacting in the present moment. Prerequisites: Sixth College students only; CAT 1.",
    "CAT 3": "Lower-division writing- and research-intensive course focusing on collaboration, research, and art-making by speculating on how the relationships between culture, art, and technology will be transformed in the future. Prerequisites: Sixth College students only; CAT 2.",
    "CAT 24": "Lower-division students are introduced to projects/topics exploring the interplay of culture, art, and technology. Topics and projects will vary. May be taken for credit two times. Prerequisites: department authorization required.",
    "CAT 75": "Seminars are hands-on arts experiences (performances, exhibits, site visits, etc.). Students and faculty attend events together and have discussions before or after, often with guest speakers such as the artists, curators, and/or faculty/graduate students from UC San Diego arts departments. Successful completion of this seminar series satisfies one unit of art making for the Sixth College general education requirements. May be taken for credit two times. Prerequisites: Sixth College students only.",
    "CAT 87": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students with preference given to entering first-year students. May be taken for credit four times. Prerequisites: none.",
    "CAT 90": "A lower-division seminar to introduce new Sixth College students to experiential learning in a small-group setting. It explores relevant practices in a variety of disciplines and avenues for immersive learning in areas such as community engagement, fieldwork, research, internship, and study abroad. Students will learn to access experiential learning resources and to identify and approach prospective mentors. Recommended preparation for Sixth College’s practicum requirement. May be taken for credit three times. Prerequisites: Sixth College students only; department authorization required.",
    "CAT 98": "Course designated for lower-division Sixth College students to have the opportunity to work together as a group or team on a project supervised by a faculty member in a specific department, not included in a regular curriculum, where group emphasis would be more beneficial and constructive then individual special studies. May be taken for credit three times. Prerequisites: lower-division standing; cumulative GPA of 3.0.",
    "CAT 124": "Students initiate, plan, and carry out community-based and/or research-based projects that connect classroom-based experiences and knowledge to the outlying community, and that explicitly explore the interplay of culture, art, and technology. May be taken for credit two times. Prerequisites: upper-division standing; department authorization required.",
    "CAT 124GS": "This course will have students initiate, plan, and carry out research-based and/or community-based projects. These projects will connect classroom-based experiences and knowledge to the outlying community, and explicitly explore the interplay of culture, art, and technology. Program or materials fees may apply. Prerequisites: upper-division standing; department authorization required.",
    "CAT 124RS": "Students initiate, plan, and carry out research-based and/or community-based projects that connect classroom-based experiences and knowledge to the outlying community, and that explicitly explore the interplay of culture, art, and technology. This course is a distance education course. Program or materials fees may apply. Prerequisites: upper-division standing; department authorization required.",
    "CAT 125": "Upper-division composition course in public rhetoric and practical communication, including oral presentation, writing in print formats, and digital content creation. This course also focuses on how writing can support and extend experiential learning before, during, or after students complete their practicum. Completion of lower-division writing sequence through taking CAT 1, CAT 2, and CAT 3 by students who entered as first-years, or through equivalent course work by transfer students. It is recommended that students pursuing graduate degrees select “Letter Grade” at the time of enrollment. Students will not receive credit for both CAT 125 and CAT 125R. Prerequisites: Sixth College students only; upper-division standing.",
    "CAT 125GS": "Upper-division composition course in public rhetoric and practical communication, including oral presentation, writing in print formats, and digital content-creation. This course also focuses on how writing can support and extend experiential learning before, during, or after students complete their practicum. Completion of lower-division writing requirement is preferred but not required. It is recommended that students pursuing graduate degrees select “Letter Grade” at the time of enrollment. This course is a distance education course. Program or materials fees may apply. Prerequisites: upper-division standing; department authorization required.",
    "CAT 125R": "Online upper-division composition course in public rhetoric and practical communication, including oral presentation, writing in print formats, and digital content-creation. This course also focuses on how writing can support and extend experiential learning before, during, or after students complete their practicum. Completion of lower-division writing sequence through taking CAT 1, CAT 2, and CAT 3 by students who entered as first-years, or through equivalent course work by transfer students. It is recommended that students pursuing graduate degrees select “Letter Grade” at the time of enrollment. Students will not receive credit for both CAT 125R and CAT 125. This course is a distance education course. Prerequisites: Sixth College students only; upper-division standing.",
    "CAT 125RS": "Online upper-division composition course in public rhetoric and practical communication, including oral presentation, writing in print formats, and digital content-creation. This course also focuses on how writing can support and extend experiential learning before, during, or after students complete their practicum. Completion of lower-division writing requirement is preferred but not required. It is recommended that students pursuing graduate degrees select “Letter Grade” at the time of enrollment. This course is a distance education course. Program or materials fees may apply. Prerequisites: upper-division standing; department authorization required.",
    "CAT 192": "The Senior Seminar Program is designed to allow senior undergraduates to meet with faculty members in a small group setting to explore an intellectual topic in culture, art, and technology (at the upper-division level). Topics will vary from quarter to quarter. Enrollment is limited to twenty students, with preference given to seniors. May be taken for credit four times. Prerequisites: upper-division standing; department authorization required.",
    "CAT 195": "Undergraduate instructional assistance. Responsibilities in areas of learning and instruction. May collect course material and assist with course projects, digital workshops, and collection, organization, and analysis of formative assessment data. Prerequisites: upper-division standing; 3.0 cumulative GPA; department authorization required.",
    "CAT 197": "Supervised community-based or industry-based fieldwork. Designated for Sixth College students to have the opportunity to work on a community-based or industry-based project supervised by a faculty member and community or industry mentor in which the subject or content of the project cannot be represented by a specific academic department. Students will submit written evaluations each week of their ongoing field study. May be taken for credit three times. Prerequisites: upper-division standing; completion of lower-division writing sequence through taking CAT 1, CAT 2, and CAT 3 by students who entered as first-years, or through equivalent course work by transfer students.",
    "CAT 198": "Directed group studies or, in group, field studies of a creative project. Designated for Sixth College students to have the opportunity to work together as a group or team on a project supervised by a faculty member in a specific department, not included in a regular curriculum, where group emphasis would be more beneficial and constructive than individual special studies. May be taken for credit three times. Prerequisites: upper-division standing; completion of lower-division writing sequence through taking CAT 1, CAT 2, and CAT 3 by students who entered as first-years, or through equivalent course work by transfer students.",
    "CAT 199": "Individual independent research or creative project. Designated for Sixth College students to have the opportunity to work on a project supervised by a faculty member in a specific department, where the subject or content of the project cannot be represented by the academic department of the faculty member. May be taken for credit three times. Prerequisites: upper-division standing; completion of lower-division writing sequence through taking CAT 1, CAT 2, and CAT 3 by students who entered as first-years, or through equivalent course work by transfer students.",
    "DSC 10": "This first course in data science introduces students to data exploration, statistical inference, and prediction. It introduces the Python programming language as a tool for tabular data manipulation, visualization, and simulation. Through homework assignments and projects, students are given an opportunity to develop their analytical skills while working with real-world datasets from a variety of domains. Prerequisites: none.",
    "DSC 20": "Provides an understanding of the structures that underlie the programs, algorithms, and languages used in data science by expanding the repertoire of computational concepts introduced in DSC 10 and exposing students to techniques of abstraction. Course will be taught in Python and will cover topics including recursion, higher-order functions, function composition, object-oriented programming, interpreters, classes, and simple data structures such as arrays, lists, and linked lists. Prerequisites: DSC 10. Restricted to students within the DS25 major. All other students will be allowed as space permits.",
    "DSC 30": "Builds on topics covered in DSC 20 and provides practical experience in composing larger computational systems through several significant programming projects using Java. Students will study advanced programming techniques including encapsulation, abstract data types, interfaces, algorithms and complexity, and data structures such as stacks, queues, priority queues, heaps, linked lists, binary trees, binary search trees, and hash tables. Prerequisites: DSC 20. Restricted to students within the DS25 major. All other students will be allowed as space permits.",
    "DSC 40A": "The sequence DSC 40A-B introduces the theoretical foundations of data science. DSC 40A, the first course in the sequence, exposes students to the mathematical theory underlying fundamental topics in machine learning. Topics include empirical risk minimization, optimization, regression, classification, and discrete probability. Students practice creative problem-solving while learning how to rigorously justify and communicate mathematical ideas. Prerequisites: DSC 10, MATH 20C or MATH 31BH, and MATH 18 or MATH 20F or MATH 31AH. Restricted to students within the DS25 major. All other students will be allowed as space permits.",
    "DSC 40B": "The marriage of data, computation, and inferential thinking, or “data science,” is redefining how people and organizations solve challenging problems and understand the world. This course bridges lower- and upper-division data science courses as well as methods courses in other fields. Students master the data science life-cycle and learn many of the fundamental principles and techniques of data science spanning algorithms, statistics, machine learning, visualization, and data systems. Prerequisites: DSC 30 and DSC 40A. Restricted to students within the DS25 major. All other students will be allowed as space permits.",
    "DSC 80": "Students will learn about a variety of topics in data science through interactive presentations from faculty and industry professionals. May be taken for credit up to four times. Prerequisites: DSC 10. Restricted to students within the DS25 major. All other students will be allowed as space permits.",
    "DSC 90": "Students will receive training in skills and techniques necessary to be effective tutors for data science courses. Students will also gain practical experience in tutoring students on data science topics. Prerequisites: DSC 10. Students must have applied for and been accepted as a tutor for a DSC course for the first time; enrollment in DSC 95 is required for these students.",
    "DSC 95": "Students will explore topics and tools relevant to the practice of data science in a workshop format. The instructor works with students on guided projects to help students acquire knowledge and skills to complement their course work in the core data science classes. Topics vary from quarter to quarter. Students are strongly recommended to enroll in either DSC 10 or DSC 20 concurrently. Prerequisites: none. Restricted to students within the DS25 major. All other students will be allowed as space permits.",
    "DSC 96": "Individual research on a topic related to data science, by special arrangement with and under the direction of a UC San Diego faculty member, in connection with an internship at an organization. It is the students’ responsibility to find an internship related to data science prior to enrolling in this course. Internship work will inform but not necessarily define the research topic. The research topic is expected to promote the study of the principles and techniques involved in the internship work. May be taken for credit up to two times. Prerequisites: MATH 20C or MATH 31BH and MATH 18 or MATH 31AH and DSC 20 and DSC 40A. Completion of thirty units at UC San Diego with a university GPA of 3.0. Special Studies form, consent of the instructor, and approval of the department required. Priority enrollment is given to data science majors DS25. Restricted to first-year and sophomore level students.",
    "DSC 97": "Students will investigate a topic in data science through directed reading, discussion, and project work under the supervision of a faculty member. May be taken for credit up to two times. Prerequisites: MATH 20C or MATH 31BH and MATH 18 or MATH 31AH and DSC 20 and DSC 40A. Completion of thirty units at UC San Diego with a university GPA of 3.0. Special Studies form, consent of the instructor, and approval of the department required. Priority enrollment is given to data science majors DS25. Restricted to first-year and sophomore level students.",
    "DSC 98": "Students will participate in independent study or research in data science under the direction of a UC San Diego faculty member. May be taken for credit up to two times. Prerequisites: MATH 20C or MATH 31BH and MATH 18 or MATH 31AH and DSC 20 and DSC 40A. Completion of thirty units at UC San Diego with a university GPA of 3.0. Special Studies form, consent of the instructor, and approval of the department required. Priority enrollment is given to data science majors DS25. Restricted to first-year and sophomore level students.",
    "DSC 99": "This course is an introduction to storage and management of large-scale data using classical relational (SQL) systems, with an eye toward applications in data science. The course covers topics including the SQL data model and query language, relational data modeling and schema design, elements of cost-based query optimizations, relational data base architecture, and database-backed applications. Prerequisites: DSC 40B and DSC 80. Restricted to students with upper-division standing. Restricted to students within the DS25 major. All other students will be allowed as space permits.",
    "DSC 100": "This course introduces the principles of computing systems and infrastructure for scaling analytics to large datasets. Topics include memory hierarchy, distributed systems, model selection, heterogeneous datasets, and deployment at scale. The course will also discuss the design of systems such as MapReduce/Hadoop and Spark, in conjunction with their implementation. Students will also learn how dataflow operations can be used to perform data preparation, cleaning, and feature engineering. Prerequisites: DSC 100. Restricted to students with upper-division standing. Restricted to students within the DS25 major. All other students will be allowed as space permits.",
    "DSC 102": "The course will introduce a variety of No-SQL data formats, data models, high-level query languages, and programming abstractions representative of the needs of modern data analytic tasks. Topics include hierarchical graph database systems, unrestricted graph database systems, array databases, comparison of expressive power of the data models, and parallel programming abstractions, including Map/Reduce and its descendants. Prerequisites: DSC 100. Restricted to students with upper-division standing. Restricted to students within the DS25 major. All other students will be allowed as space permits.",
    "DSC 104": "Data visualization helps explore and interpret data through interaction. This course introduces the principles, techniques, and algorithms for creating effective visualizations. The course draws on the knowledge from several disciplines including computer graphics, human-computer interaction, cognitive psychology, design, and statistical graphics and synthesizes relevant ideas. Students will design visualization systems using D3 or other web-based software and evaluate their effectiveness. Prerequisites: DSC 80. Restricted to students with upper-division standing. Restricted to students within the DS25 major. All other students will be allowed as space permits.",
    "DSC 106": "This course will focus on ideas from classical and modern signal processing, with the main themes of sampling continuous data and building informative representations using orthonormal bases, frames, and data dependent operators. Topics include sampling theory, Fourier analysis, lossy transformations and compression, time and spatial filters, and random Fourier features and connections to kernel methods. Sources of data include time series and streaming signals and various imaging modalities. Prerequisites: MATH 18 or MATH 31AH and MATH 20C and DSC 40B. Restricted to students with upper-division standing. Restricted to students within the DS25 major. All other students will be allowed as space permits.",
    "DSC 120": "The course covers learning and using probabilistic models for knowledge representation and decision-making. Topics covered include graphical models, temporal models, and online learning, as well as applications to natural language processing, adversarial learning, computational biology, and robotics. Prior completion of MATH 181A is strongly recommended. Prerequisites: DSC 80 and ECE 109 or ECON 120A or MAE 108 or MATH 180A or MATH 183 or MATH 186. Restricted to students with upper-division standing. Restricted to students within the DS25 major. All other students will be allowed as space permits.",
    "DSC 140A": "This course is an introduction to machine learning which explores techniques for learning suitable representations from data. Topics include clustering, dimensionality reduction, manifold learning, principal component analysis, spectral embeddings, multilayer perceptrons, autoencoders, convolutional and recurrent neural networks, and other aspects of deep learning. The course focuses on the underlying mathematical principles, but some attention is also given to implementation. Prerequisites: DSC 80, ECE 109 or ECON 120A or MAE 108 or MATH 180A or MATH 183 or MATH 186. Restricted to students within the DS25 major. All other students will be allowed as space permits.",
    "DSC 140B": "This course mainly focuses on introducing current methods and models that are useful in analyzing and mining real-world data. It will cover frequent pattern mining, regression and classification, clustering, and representation learning. All participants should be comfortable with programming, and with basic optimization and linear algebra. Prerequisites: DSC 40B or CSE 12, DSC 80 or CSE 15L, MATH 180A or MATH 181A or MATH 183 or CSE 103 or ECE 109 or ECON 120A. Students may not receive credit for DSC 148 and CSE 158 or CSE 158R. Restricted to students within the DS25 major. All other students will be allowed as space permits.",
    "DSC 148": "Rigorous treatment of principal component analysis, one of the most effective methods in finding signals amidst the noise of large data arrays. Topics include singular value decomposition for matrices, maximal likelihood estimation, least squares methods, unbiased estimators, random matrices, Wigner’s semicircle law, Markchenko-Pastur laws, universality of eigenvalue statistics, outliers, the BBP transition, applications to community detection, and stochastic block model. Prerequisites: MATH 180A and (MATH 18 or MATH 31AH). Students will not receive credit for both MATH 182 and DSC 155.",
    "DSC 155": "This course addresses the intersection of data science and contemporary arts and culture, exploring four main themes of authorship, representation, visualization, and data provenance. The course is not solely an introduction to data science techniques nor merely an arts practice course, but explores significant new possibilities for both fields arising from their intersection. Students will examine problems from complementary perspectives of artist-researchers and data scientists. Prerequisites: DSC 80.",
    "DSC 160": "This class explores statistical and computational methods to enable students to use text as a data source in the social sciences. Hands-on examples will equip students to work with text data in final projects. Prerequisites: ECON 5 or POLI 170A or POLI 171 or POLI 30 or POLI 30D or POLI 5 or POLI 5D. Students will not receive credit for both POLI 176 and DSC 161. Restricted to junior and senior level students. Restricted to students with upper-division standing.",
    "DSC 161": "This course examines the greater context under which the practice of data science exists and explores concrete ways these issues surface in technical work. Students learn frameworks for understanding how individuals relate to social institutions, how to use them to identify how issues of fairness arise in the “life of a data scientist,” and use them to propose and critique potential solutions. Prerequisites: DSC 80.",
    "DSC 167": "Spatial data science is a set of concepts and methods that deal with accessing, managing, visualizing, analyzing, and reasoning about spatial data in applications where location, shape and size of objects, and their mutual arrangement are important. This upper-division course explores advanced data science concepts for spatial data, introducing students to principles and techniques of spatial data analysis, including geographic information systems, spatial big data management, and geostatistics. Prerequisites: DSC 80. Restricted to students with upper-division standing.",
    "DSC 170": "In this two-course sequence students will investigate a topic and design a system to produce statistically informed output. The investigation will span the entire lifecycle, including assessing the problem, learning domain knowledge, collecting/cleaning data, creating a model, addressing ethical issues, designing the system, analyzing the output, and presenting the results. 180A deals with research, methodology, and system design. Students will produce a research summary and a project proposal. Prerequisites: DSC 102 and MATH 189 and CSE 151A or COGS 188 or CSE 158 or CSE 158R or DSC 148 and DSC 106. Restricted to students with upper-division standing. Restricted to students within the DS25 major.",
    "DSC 180A": "In this two-course sequence students will investigate a topic and design a system to produce statistically informed output. The investigation will span the entire lifecycle, including assessing the problem, learning domain knowledge, collecting/cleaning data, creating a model, addressing ethical issues, designing the system, analyzing the output, and presenting the results. 180B will consist of implementing the project while studying the best practices for evaluation. Prerequisites: DSC 180A. Students are only cleared to enroll into the discussion section associated with their DSC 180A discussion section. Restricted to students with upper-division standing. Restricted to students within the DS25 major.",
    "DSC 180B": "Topics of special interest in data science. Topics vary from quarter to quarter. May be taken for credit up to four times when topic varies. Prerequisites: department and instructor approval required to monitor enrollment and to ensure that students have the sufficient educational background for a given topic. Restricted to students with upper-division standing.",
    "DSC 190": "A seminar course on topics of current interest in data science. Topics may vary from quarter to quarter. May be taken for credit three times. Prerequisites: restricted to students with upper-division standing. Department and instructor approval is required to monitor enrollment and to ensure that students have the sufficient educational background for a given topic.",
    "DSC 191": "Directed study and research at laboratories/institutions outside of campus. It is the students’ responsibility to find an internship related to data science prior to enrolling in this course. Prerequisites: restricted to students with upper-division standing. Consent of the instructor and approval of the department. An application for Special Studies must be filed with the Registrar’s office after approval from the instructor and the department chair.",
    "DSC 197": "Data science topics whose study involves reading and discussion by a small group of students under supervision of a faculty member. May be taken for credit up to two times. Prerequisites: restricted to students with upper-division standing. Consent of the instructor and approval of the department. Department stamp required. An application for Special Studies must be filed with the Registrar’s office after approval from the instructor and the department chair.",
    "DSC 198": "Independent reading or research on a topic related to data science by special arrangement with a faculty member. May be taken for credit up to two times. Prerequisites: restricted to students with upper-division standing. Consent of the instructor and approval of the department. An application for Special Studies must be filed with the Registrar’s Office after approval from the instructor and the department chair.",
    "DSC 199": "Computing structures and programming concepts such as object orientation, data structures such as queues, heaps, lists, search trees, and hash tables. Laboratory skills include Jupyter notebooks, RESTful interfaces, and various software development kits (SDKs). Prerequisites: none. Restricted to students within the DS75 and DS76 major.",
    "DSC 200": "Principles of data management, relational data model, relational algebra, SQL for data science, NoSQL databases (document, key-value, graph, column-family), multidimensional data management (data warehousing, OLAP Queries, OLAP Cubes, visualizing multidimensional data). Prerequisites: none. Restricted to students within the DS75 and DS76 major.",
    "DSC 202": "Commonly used algorithms and techniques in data visualization. Interactive reasoning and exploratory analysis through visual interfaces. Application of data visualization in various domains including science, engineering, and medicine. Scalable interactive methods involving exploring big data and visualization methods. Techniques to evaluate effectivity and interpretability of analytical products for diverse users to obtain insights in support of assessment, planning, and decision making. Prerequisites: DSC 202. Restricted to students within the DS75 and DS76 major.",
    "DSC 203": "Storage/memory hierarchy, distributed scalable computing (cluster, cloud, edge) principles. Big data storage, management, and processing at scale. Dataflow programming systems and programming models (MapReduce/Hadoop and Spark). Prerequisites: DSC 202. Restricted to students within the DS75 and DS76 major.",
    "DSC 204A": "This course will cover graph-based data modeling, analysis, and representation. Topics include spectral graph theory, spectral clustering, kernel-based manifold learning, dimensionality reduction and visualization, multiway data analysis, graph signal processing, graph neural networks. Prerequisites: DSC 210 or ECE 269 and DSC 212 and DSC 240. Restricted to students within the DS75 and DS76 major.",
    "DSC 205": "This course studies the mathematical foundations of massive data processing, developing algorithms, and analyzing them. We explore methods for sampling, sketching, and distributed processing of large scale databases, clustering, dimensionality reduction, and methods of optimization for the purpose of scalable statistical description, querying, pattern mining, and learning from data. Prerequisites: DSC 212. Restricted to students within the DS75 and DS76 major.",
    "DSC 206": "Essential tools for data science including the basic process of data science; Python and Jupyter notebooks; finding answers within large datasets by using Python to import data, explore it, analyze it, learn from it, visualize it, and generate easily shareable reports. An applied understanding of how to manipulate and analyze uncurated datasets; basic statistical analysis and machine learning methods; and how to effectively visualize results. This is a distance education course. Prerequisites: none. Restricted to major code DS77. All other students with graduate standing may be considered as space permits.",
    "DSC 207R": "Principles, techniques, and tools for organizing, storing, querying, transforming, and using data for analytics and machine learning computations at scale; including the relational data model, relational algebra, database system features for faster querying, and non-relational data systems. Introduction to data quality issues, data cleansing, cluster and cloud computing, and transformation for feature engineering. Evaluation of analytics results including reasoning about bias and fairness. This is a distance education course. Prerequisites: DSC 207R. Restricted to major code DS77. All other students with graduate standing may be considered as space permits.",
    "DSC 208R": "Linear algebraic systems, least squares problems and regularization, orthogonalization methods, ill-conditioned problems, eigenvalue and singular value decomposition, principal component analysis, structured matrix factorization and fast algorithms, randomized linear algebra, JL lemma, sparse approximations. Prerequisites: none. Restricted to students within the DS75 and DS76 major.",
    "DSC 210": "Continuity and differentiability of a function of several variables, gradient vector, Hessian matrices, Taylor approximation, fundamentals of optimization, Lagrange multipliers, convexity, gradient descent. Prerequisites: DSC 210. Restricted to students within the DS75 and DS76 major.",
    "DSC 211": "Probability, random variables, distributions, central limit theorem, maximum likelihood estimation, method of moments, confidence intervals, hypothesis testing, Bayesian estimation, introduction to simulation and the bootstrap. Prerequisites: none. Restricted to students within the DS75 and DS76 major.",
    "DSC 212": "This is a graduate topics course covering statistics with manifold constraints. Topics include Frechet means and variances, principal geodesic analysis, directional statistics, random fields on manifolds, statistical distances between distributions, transport problems, and information geometry. Manifold constraints will be considered on simplexes, spheres, Stiefel manifold, stratified manifolds, cone of positive definite matrices, trees, compositional data, and other relevant manifolds. Prerequisites: DSC 210 and DSC 212. Restricted to students within the DS75 and DS76 major.",
    "DSC 213": "Topology provides a powerful way to describe essential features of functions and spaces. In recent years topological methods have attracted much attention for analyzing complex data. Fundamental developments have been made and the resulting methods have been applied in many fields, e.g., graphics, visualization, neuroscience, and material science. This course introduces basic concepts and topological structures behind these developments, algorithms for them, and examples of applications. Prerequisites: none. Restricted to students within the DS75 and DS76 major.",
    "DSC 214": "The goal of this course is to evaluate any paper in data science, regardless of application area. Topics include experimental design, claims, evidence, and statistical significance, the replication crisis, falsifiability, philosophy of science, history of probability and statistics. This class will be in the form of an open discussion based on provided reading materials. Prerequisites: none. Restricted to students within the DS75 and DS76 major.",
    "DSC 215": "Foundations of probability and statistics needed for data science, including mathematical theory, and hands-on experience of applying this theory to actual data using Jupyter notebooks. Random variables, dependence, correlation, regression, PCA, entropy and MDL. This course is a distance education course. Prerequisites: none. Restricted to major code DS77. All other students with graduate standing may be considered as space permits.",
    "DSC 215R": "Sensory data and control is mediated by devices near the edge of sensor networks, referred to as IOT (Internet of Things) devices. Components of IOT platforms: signal processing, communications/networking, control, real-time operating systems. Interfaces to cloud computing stack, publish-subscribe protocols such as MQTT, embedded software/middleware components, metadata schema, metadata normalization methods, applications in selected CPS (cyber-physical system) applications. Prerequisites: none. The class is designed for electronic enthusiasts who are quick learners on new embedded, sensor network devices. Restricted to students within the DS75 and DS76 major.",
    "DSC 231": "This course covers techniques for achieving scalability in data analysis, using tools such as MapReduce, Hadoop, and Spark. Topics include programming Spark using PySpark; identifying the computational tradeoffs in a Spark application; performing data loading and cleaning using Spark and Parquet; modeling data through statistical and machine learning methods, and mitigating bottlenecks that arise in massive parallel computations by using the Spark framework. This is a distance education course. Prerequisites: DSC 255R. Restricted to major code DS77. All other students with graduate standing may be considered as space permits.",
    "DSC 232R": "A graduate level course in machine learning algorithms: decision trees, principal component analysis, k-means, clustering, logistic regression, random forests, boosting, neural networks, kernel methods, deep learning. Prerequisites: DSC 210 and DSC 212. Restricted to students within the DS75 and DS76 major.",
    "DSC 240": "Linear/nonlinear models, generalized linear models, model fitting and model selection (cross-validation, knockoffs, etc.), regularization and penalization (ridge regression, lasso, etc.), robust methods, nonparametric regression, conformal prediction, causal inference. Prerequisites: DSC 210 and DSC 212. Restricted to students within the DS75 and DS76 major.",
    "DSC 241": "Concentration inequalities, Markov processes and ergodicity, martingale inequalities, empirical processes, sparse linear models in high dimensions, principal component analysis in high dimensions, estimation of large covariance matrices. Prerequisites: none. Restricted to DS75 and DS76 students.",
    "DSC 242": "Linear/quadratic programming, optimization under constraints, gradient descent (deterministic and stochastic), convergence rate of gradient descent, acceleration phenomena in convex optimization, stochastic optimization with large data sets, complexity lower bounds for convex optimization. Prerequisites: DSC 211 and DSC 212. Restricted to DS75 and DS76 students.",
    "DSC 243": "Exploratory data analysis, diagnostics, bootstrap, large-scale (multiple) hypothesis testing, false discovery rate, empirical Bayes methods. Prerequisites: DSC 210 and DSC 212 and DSC 241. Restricted to DS75 and DS76 students.",
    "DSC 244": "Causal versus predictive inference, potential outcomes and randomized experiments (A/B testing), structural causal models (interventions, counterfactuals, causal diagram, do-operator, d-separation), causal structure learning, identification of causal effect, estimation of causal effect, causal discovery and inference in presence of distribution shifts, selection bias, hidden confounders, cycles, nonlinear causal mechanisms, missing values, causal representation learning. Prerequisites: DSC 212 and DSC 240. Restricted to DS75 and DS76 students.",
    "DSC 245": "Graph mining and basic text analysis (including keyphrase extraction and generation), set expansion and taxonomy construction, graph representation learning, graph convolutional neural networks, heterogeneous information networks, label propagation, and truth findings. Prerequisites: none. Restricted to DS75 and DS76 students.",
    "DSC 250": "Estimation of stability and uncertainty, optimal control, and sequential decision making. Prerequisites: DSC 211 and DSC 240. Restricted to DS75 and DS76 students.",
    "DSC 251": "Diving deep to the classical NLP pipeline: tokenization, stemming, lemmatization, part-of-speech tagging, named entity recognition, parsing, and machine translation. Finite-state transducer, context-free grammar, hidden Markov models (HMM), and conditional random fields (CRF) will be covered in detail. Prerequisites: none. Restricted to DS75 and DS76 students.",
    "DSC 252": "Unsupervised, weakly supervised, and distantly supervised methods for text mining problems, including information retrieval, open-domain information extraction, text summarization (both extractive and generative), and knowledge graph construction. Bootstrapping, comparative analysis, learning from seed words and existing knowledge bases will be the key methodologies. Prerequisites: none. Restricted to DS75 and DS76 students.",
    "DSC 253": "A graduate level course on signal and image analysis spanning three main themes. Statistical signal processing: random processes, stochasticity, stationarity, Wiener filter, Kalman filter, matched filter; signal processing: time-frequency representations, wavelets, signal processing with sparse representation (dictionary learning); image processing: registration, image degradation and restoration: noise models + denoising, image pyramids, random fields. Prerequisites: DSC 210 or ECE 269 and DSC 212. Need to verify background in signal processing from undergraduate or other graduate courses. Restricted to DS75 and DS76 students.",
    "DSC 254": "Supervised and unsupervised learning algorithms, and the theory behind those algorithms. Using case studies, covered topics include classification, regression, and conditional probability estimation; generative and discriminative models; linear models and extensions to non-linearity using kernel methods; ensemble methods: boosting, bagging, random forests; representation learning: clustering, dimensionality reduction, auto-encoders, deep neural networks. This is a distance education course. Prerequisites: DSC 215R. Restricted to major code DS77. All other students with graduate standing may be considered as space permits.",
    "DSC 255R": "Application of machine learning and data mining techniques, recommender systems, data mining, and predictive analytics. Building models to understand data in order to gain insights and make predictions. Covered topics include regression; classification; unsupervised learning and dimensionality reduction; recommender systems; text mining; social network analysis; data visualization; and online advertising. This course is a distance education course. Prerequisites: DSC 215R. Restricted to major code DS77. All other students with graduate standing may be considered as space permits.",
    "DSC 256R": "Broad view of the field of unsupervised learning, in particular its most common methods and use cases. Topics include descriptive statistics; clustering; projection, singular value decomposition, and spectral embedding; common probability distributions; density estimation; graphical models and latent variable modeling; sparse coding and dictionary learning; autoencoders, shallow and deep; and self-supervised learning. Prerequisites: DSC 255R. Restricted to major code DS77. All other students with graduate standing may be considered as space permits.",
    "DSC 257R": "Introduction to classical methods that are useful in analyzing and mining real-world text data, including tokenization, stemming and lemmatization, bag-of-words classification, word embedding, language models, sentiment analysis, part-of-speech tagging, named entity recognition, and sequence-to-sequence models. Consideration of possible biases, privacy, and societal implications in these models. This is a distance education course. Prerequisites: DSC 255R. Restricted to major code DS77. All other students with graduate standing may be considered as space permits.",
    "DSC 258R": "This course will consider foundational concepts including power, justice, bias, privacy, and explainability; societal practices including delegation, organizational incentives, and accountability; and governance mechanisms including law, regulation, and norms. Prerequisites: none. Restricted to DS75 and DS76 students.",
    "DSC 260": "Data science lifecycle, data cleaning and quality management, data profiling, causal inference, algorithmic fairness (fairness definitions, impossibility results, causal fairness, building fair ML models, fairness beyond classification), algorithmic transparency (interpretability versus explainability, auditing-black-box algorithms, algorithmic recourse). Prerequisites: DSC 210 and DSC 240. Restricted to DS75 and DS76 students.",
    "DSC 261": "Examination of the inevitable ethical questions and issues that arise in all stages of data science, including issues of privacy, bias, trust, and more. Conceptual and mathematical tools that can be used both to recognize and address these ethical issues as they arise in real-world practice. This is a distance education course. Prerequisites: DSC 208R and DSC 255R. Restricted to major code DS77. All other students with graduate standing may be considered as space permits.",
    "DSC 267R": "A graduate seminar course in which topics of special interest in data science will be presented by faculty or by graduate students under faculty direction. Restricted to graduate level students. May be repeated for credit twenty-four times as topics vary. Prerequisites: none.",
    "DSC 290": "Topics of special interest in data science. Topics may vary quarter to quarter. Restricted to graduate level students. Prerequisites: none.",
    "DSC 291": "Weekly faculty research seminar. Individual HDSI colloquia and distinguished lecturers may be included at the discretion of the instructor. May be taken for credit up to twenty-four times. Prerequisites: none.",
    "DSC 293": "Research rotations provide the opportunity for first-year PhD students to obtain research experience in data analysis under the guidance of HDSI affiliated faculty members. Through the rotations, students can identify a faculty member under whose supervision their dissertation research will be completed. Each research rotation is quarter-long; working with a HDSI faculty member and students are required to complete three separate rotations. Each student is required to take the course three times with at least two different instructors. Prerequisites: none. Only first-year PhD students are eligible.",
    "DSC 294": "Basic skills necessary to succeed as a researcher in data science including scripting, cloud computing skills, fellowship proposal preparation, CV preparation, writing reviews, preparing posters, etc. Prerequisites: none.",
    "DSC 295": "Following the life cycle of a data science project, students apply advanced data science knowledge and techniques to a specific domain. Cleaning and structuring data for hypothesis generation and data analysis; creating a scalable big date pipeline from data ingestion and exploration, to modeling and evaluation; building machine learning models and evaluating insights; communicating finding through visualizations and reports; fully considering ethical implications throughout. Prerequisites: DSC 208R, DSC 255R, and DSC 256R. Restricted to students within the DS77 degree program. All other students with graduate standing may be considered as space permits.",
    "DSC 298R": "Graduate research. May be taken for credit up to twenty-four times. Prerequisites: none.",
    "DSC 299": "A course in which teaching assistants are aided in learning proper teaching methods by means of supervision of their work by the faculty: handling of discussions, preparation and grading of examinations and other written exercises, and student relations. Number of units for credit depends on number of hours devoted to class or section assistance. May be taken for credit up to seventy-two units. Prerequisites: DSC 500 is for selected teaching assistants only; therefore, consent of instructor is required.",
    "DSC 500": "Training in teaching methods in the field of data science. This course examines theoretical and practical communication and teaching techniques particularly appropriate to data science. Prerequisites: Consent of faculty required. Only graduate students who are TAing for the first time in the data science program are eligible to enroll.",
    "DOC 1": "This course focuses on sociocultural diversity in examining class, ethnicity, race, gender, and sexuality as significant markers of differences among persons. Emphasizing American society while cultivating students’ critical reading skills, it explores the cultural understandings of diversity and its economic, moral, and political consequences. Restrictions: Marshall College students only, must be taken for a letter grade. Prerequisites: satisfaction of UC Entry Level Writing Requirement or concurrent enrollment in AWP 1: Analytical Writing. (F)",
    "DOC 2": "This course considers the nature of justice in philosophical, historical, and legal terms. Topics include racial justice, political representation, economic justice, gender and justice, the rights of cultural minorities, and crime and punishment. The course offers intensive instruction in writing university-level expository prose, specifically thesis-based argumentative essays. Restrictions: Marshall College students only, must be taken for a letter grade. Prerequisites: satisfaction of UC Entry Level Writing Requirement and completion of DOC 1. Enrollment by department approval only. (W)",
    "DOC 3": "This course examines the relevance of sociocultural diversity and the nature of justice in explicitly local and contemporary contexts. Students are asked to imagine and propose rigorously researched and interdisciplinary solutions to issues relevant to their own lived experiences. The course offers intensive instruction in writing university-level expository prose, with special emphasis on developing a research process. Restrictions: Marshall College students only, must be taken for a letter grade. Prerequisites: DOC 2. (S)",
    "DOC 100D": "This course provides a broad overview of key historical contradictions in US history and explores the origins of social stratifications and movements. Students acquire tools for analyzing national tensions. Central aspects include slavery, women’s rights, and rising corporate power. Course introduces concepts at the intersections of class, gender, religion, race, and sexuality. Students learn to analyze and discuss complex historical/societal artifacts. Designed for two student sectors: 1) Marshall College transfer students who have not taken the DOC sequence, and 2) Transfer and other upper-division students from all seven colleges who want to fulfill the campuswide diversity requirement. Prerequisites: upper-division standing and completion of college writing.",
    "EDS 20S": "Students will study discipline-specific principles of effective learning, including critical thinking, problem solving, collaboration, and group communication. Laboratory and hypothesis testing, library research and writing skills, and self-assessment. Students will explore concepts and procedures in mathematics, science, and economics. Prerequisites: Summer Bridge participation. Department approval required.",
    "EDS 21S": "Reading, writing, and speaking exercises will introduce students to the teaching conventions and learning expectations of American universities. Students will use writing as a means of academic inquiry to explore the culture of higher education in the United States and will gain practice with appropriate style, structure, and mechanics. P/NP grades only. Prerequisites: department approval required.",
    "EDS 22": "Cuba’s educational system achieves higher outcomes than any other country in Latin America, and compared to the United States, it represents a very different institutional structure. Cuban education serves as an explicit vehicle for the transmission of Cuban culture and historical consciousness. This course examines Cuba’s emphasis on educational achievement following the triumph of its revolution in 1959, including institutional structures, pedagogy, and content. Prerequisites: Summer Bridge participation, instructor approval required.",
    "EDS 22S": "This course provides a combination of seminar work and intensive field experience after the end of the spring quarter, during special summer session. Topics are introduced and analyzed in seminars and reinforced and expanded upon in field visits to historic and cultural sites in Cuba. Additional fees may be required for travel expenses. Prerequisites: students must be participants in the OASIS Learning Communities Program. Enrollment by instructor approval only. Due to expenses of field experience, enrollment will be limited to students who have completed EDS 22 and attended planning meetings with the instructor to discuss cost and travel requirements.",
    "EDS 23": "Course focuses on challenges that confront college students in their second year of higher education and solutions. Emphasis on historically underrepresented students of color with more complex adjustment to college. Analysis of national trends from research including High Impact Practices. This course includes the essential role of utilizing undergraduate tutors to help foster academic and social community within the context of higher education. Prerequisites: department approval required. This course is a collaboration with Student Affairs “2 Excel Program.” Enrollees should only be program participants.",
    "EDS 24": "This course will introduce students to campus systems that are critical for their success and will provide them with the opportunity to learn about how to make the most out of their college experience. Prerequisites: department/instructor approval required. This course is intended for first-year students who completed OASIS Summer Bridge Program.",
    "ERC 1": "This course facilitates academic success at a leading research university by helping students understand and embrace academic and curricular expectations, engage and map cocurricular opportunities, and strengthen critical thinking, organizational, interpersonal, and wellness skills. P/NP grades only. Prerequisites: open to ERC NFRS students only.",
    "ERC 2": "This course facilitates academic success at a leading research university by helping students understand and embrace academic and curricular expectations, engage and map cocurricular opportunities, and strengthen critical thinking, organizational, interpersonal, and wellness skills. P/NP grades only. Prerequisites: open to ERC transfer students only.",
    "ERC 20": "This weekly seminar focuses on a chosen international theme with faculty speakers. The structure of the seminar is informal, giving students the opportunity to participate in interactive discussions. Pass/Not Pass only. May be taken for credit three times as topics vary. Prerequisites: open to students in the Eleanor Roosevelt College First-year Student Honors Program only.",
    "ERC 89": "Individual project on a topic chosen by the student, done under direction of a faculty member. Prerequisites: by invitation only. Pass/Not Pass only. Repeatable for credit twice, up to a total of six units over three quarters.",
    "ERC 92": "This weekly seminar focuses on the skills required to write an upper-division research paper and prepare for a winter quarter internship through Academic Internship Program. The structure of the seminar is informal, giving students the opportunity to participate in interactive discussions based on required reading and faculty speakers. Prerequisites: department stamp.",
    "ERC 188": "This is the first course of a two-course elective sequence (ERC 192A and ERC 192B) entitled ERC Global Service and Research. ERC 192A provides an academic introduction to the culture and history of the nation and region selected for this undergraduate academic, practicum, and research experience to prepare students for the subsequent service and research portion (ERC 192B). Note: The course is open to all students. Students must have completed course work in relevant topics, such as regional history, economics, culture. Prerequisites: department stamp.",
    "ERC 192A": "Senior thesis research project for students who have been accepted into the Eleanor Roosevelt College Individual Studies major. Project will be carried out under supervision of one or more faculty members. Depending on scope of the project, may be taken for four or eight units of credit in a single quarter, or eight units distributed over two quarters. Prerequisites: admission to Eleanor Roosevelt College Individual Studies major.",
    "ERC 196": "The content of this independent study course, which may not duplicate any existing course on campus, will be determined by a supervising faculty member and tailored to fit specific content needs of students pursuing the Eleanor Roosevelt College Individual Studies major. Prerequisites: admission to Eleanor Roosevelt College Individual Studies major.",
    "ERC 199": "A seminar intended for exposing undergraduate students, especially first-year students and sophomores, to exciting research programs conducted by the faculty. Prerequisites: none. Pass/Not Pass only.",
    "ENG 5": "This course focuses on academic and personal/career planning, including resume development and preparation for future opportunities including research, internships, and graduate school. Students will gain knowledge and skills in these areas through assignments and in-class activities. This course is available for first-year undergraduate students in the IDEA Scholars program. Prerequisites: department approval required.",
    "ENVR 30": "Examines global and regional environmental issues. Fundamental scientific and civic literacy is introduced within community, policy, and economic contexts. The scope of problems include air and water pollution, climate disruption, solid waste disposal, hazardous waste treatment, and environmental impact assessment. Prerequisites: none.",
    "ESYS 10": "This course explores the interdisciplinary character of environmental issues through an examination of a particular topic (climate change, for example) from numerous disciplinary perspectives (e.g., biology, chemistry, physics, political science, and economics). Prerequisites: none.",
    "FMPH 40": "This course provides an introduction to the infrastructure of public health; the analytical tools employed by public health practitioners; bio-psychosocial perspectives of public health problems; health promotion/disease prevention; quality assessment in public health; and legal and ethical concerns. Must be taken for a letter grade to be applied to the public health major. Renumbered from FPMU 40. Students may not receive credit for FPMU 40 and FMPH 40. Prerequisites: restricted enrollment to first-year, sophomore, and junior standing.",
    "FMPH 50": "This course explores historical and current interactions, achievements, and challenges of primary care and public health. It will analyze the impact of common medical conditions such as obesity, diabetes, mental health disorders, and others on individuals, their families, and society. Must be taken for a letter grade to be applied to the public health major. Renumbered from FPMU 50. Students may not receive credit for FPMU 50 and FMPH 50. Prerequisites: restricted enrollment to first-year, sophomore, junior, and senior standing.",
    "FMPH 101": "This course covers the basic principles of epidemiology, with applications to investigations of noninfectious (“chronic”) and infectious diseases. Explores various study designs appropriate for disease surveillance and studies of etiology and prevention. Must be taken for a letter grade to be applied to the public health major. Renumbered from FPMU 101. Students may not receive credit for FMPH 101 and either FPMU 101 or FPMU 101A. Prerequisites: FMPH 40, PSYC 60 or MATH 11 or COGS 14B, and upper-division standing.",
    "FMPH 102": "Fundamentals of biostatistics and basic methods for analysis of continuous and binary outcomes for one, two, or several groups. Includes: summarizing and displaying data; probability; statistical distributions; central limit theorem, confidence intervals, hypothesis testing; comparing means of continuous variables between two groups; comparing proportions between two groups; simple and multiple linear regression. Hands-on data analysis using software and statistical applications in public health. Must be taken for a letter grade to be applied to the public health major. Renumbered from FPMU 102. Students may not receive credit for FMPH 102 and either FPMU 101B or FPMU 102. Prerequisites: FMPH 40, PSYC 60 or MATH 11 or COGS 14B, and upper-division standing.",
    "FMPH 110": "This course introduces health behavior concepts through applications to chronic disease prevention. The focus is on smoking, dietary behaviors, and physical activity and is organized around relationships to health, measurement, influencing factors, interventions, and translation to public health practice. Must be taken for a letter grade to be applied to the public health major. Renumbered from FPMU 110. Students may not receive credit for FPMU 110 and FMPH 110. Prerequisites: FMPH 40. Restricted enrollment to sophomore, junior, and senior standing.",
    "FMPH 120": "This course covers the rationale for and effectiveness of policies to influence nutrition, physical activity, and substance use behavior. Policies include legalization, taxation, labeling, produce manufacturing, warning labels, licensing, marketing, and counter-marketing practices and restrictions on use. Must be taken for a letter grade to be applied to the public health major. Renumbered from FPMU 120. Students may not receive credit for FPMU 120 and FMPH 120. Prerequisites: FMPH 40 and upper-division standing.",
    "FMPH 130": "This core public health course addresses the fundamentals of environmental and occupational health, including identification of hazards, basic toxicology, risk assessment, prevention/protection, and regulatory/control policies. Specific environmental and occupational hazards and relevant case studies will be presented. Must be taken for a letter grade to be applied to the public health major. Renumbered from FPMU 130. Students may not receive credit for FPMU 130 and FMPH 130. Prerequisites: FMPH 50, FMPH 101, and upper-division standing.",
    "FMPH 155": "An overview of the role of qualitative research methods in public health. The course will focus on qualitative research as it relates to formative program design, community-based participatory approaches, and as a tool for amplifying voices and elucidating both complex social-ecological processes and internal individual experiences. Throughout the term, students will work in teams to design, conduct, analyze, and report a full qualitative study on a public health topic of their choosing. Must be taken for a letter grade to be applied to the public health major. Students may not receive credit for FMPH 155 and FMPH 191 subtitled “Qualitative Research for Global Public Health.” Prerequisites: FMPH 40. Restricted enrollment to sophomore, junior, and senior standing.",
    "FMPH 161": "Clinical nutrition is the study of nutrition and diet as related to the prevention and treatment of human disease. The practical and psychosocial aspects of diet modification and food/food product availability are key aspects of clinical nutrition practice, whether individual or community based, irrespective of whether the goal is primary prevention or disease treatment. Students will identify applications and translation of nutritional guidelines and recommendations into behavior in the course. Must be taken for a letter grade to be applied to the public health major. Students may not receive credit for FMPH 161 and FMPH 191 subtitled “Clinical Nutrition in Public Health.” Prerequisites: FMPH 40. Restricted enrollment to sophomore, junior, and senior standing.",
    "FMPH 171": "This course consists of a series of practical epidemiological infectious and non-infectious disease paper- and computer-based exercises. Students will have the opportunity to apply their epidemiological and biostatistical skills to real-world situations. The course is highly interactive and challenges students’ knowledge and critical thinking capacities. Students will give presentations, write a scientific abstract and press release, and develop a poster. Must be taken for a letter grade to be applied to the public health major. Students may not receive credit for FMPH 171 and FMPH 191 subtitled “Field Epidemiology and Outbreak Investigations.” Prerequisites: FMPH 40 and FMPH 101. Restricted enrollment to sophomore, junior, and senior standing.",
    "FMPH 191": "Selected topics in the field of public health. Must be taken for a letter grade to be applied to the public health major. May be taken for credit up to three times. Prerequisites: FMPH 40. Restricted enrollment to sophomore, junior, and senior standing. Department approval required.",
    "FMPH 193": "This is the first of a two-part capstone series that serves as the culminating experience for the BS in public health (BSPH) majors. Students will integrate the skills and knowledge gained throughout the BSPH program and learn critical elements of public health research and practice. Must be taken for a letter grade to be applied to the public health major. Prerequisites: FMPH 40, FMPH 50, FMPH 101, FMPH 102, and FMPH 110. Department approval required. Restricted to senior public health majors only (FP25).",
    "FMPH 194": "This is the second of a two-part capstone series that serves as the culminating experience for the BS in public health (BSPH) majors. Students will interpret and contextualize findings from their projects completed in the first part of the series. Oral and written presentations will focus on disseminating public health information in diverse formats. Must be taken for a letter grade to be applied to the public health major. Prerequisites: FMPH 40, FMPH 50, FMPH 101, FMPH 102, FMPH 110, FMPH 120, and FMPH 193. Department approval required. Restricted to senior public health majors only (FP25).",
    "FMPH 195": "Introduction to teaching in a public health course. As an undergraduate instructional apprentice, students will attend the lectures of the course, weekly meetings with students of the course, and weekly meetings with the course instructor. Responsibilities may include class presentations, designing and leading weekly discussion sections, assisting with homework and exam grading, and monitoring and responding to online discussion posts. Renumbered from FPMU 195. FMPH 195 and/or FPMU 195 may be taken for credit for a combined total of two times. Prerequisites: eligibility includes all of the following: upper-division standing, a minimum of A– in the course in which the student plans to assist, a 3.0 cumulative UC GPA, and instructor and department approval.",
    "FMPH 196A": "This is the first of a three-part honors series that serves as the culminating experience for the BS in public health (BSPH) majors. Students review, reinforce, and complement skills and knowledge gained throughout the BSPH program, and prepare a proposal integrating critical elements of public health research and practice. Must be taken for a letter grade to be applied to the public health major. Prerequisites: FMPH 40, FMPH 50, FMPH 101 or FMPH 102, and FMPH 110. Department approval required. Restricted to upper-division public health majors only (FP25).",
    "FMPH 196B": "This is the second of a three-part honors series that serves as the culminating experience for the BS in public health majors. This course represents an experiential learning opportunity at a preapproved community site. Under supervision of public health faculty and pertinent site representatives, students will refine and implement the public health proposal developed in the first part of the honors series. Must be taken for a letter grade to be applied to the public health major. Prerequisites: FMPH 196A. Department approval required. Restricted to upper-division public health majors only (FP25).",
    "FMPH 196C": "This is the third of a three-part honors series that serves as the culminating experience for the BS in public health majors. Students will analyze, interpret, and contextualize findings from their projects completed in the series. Oral and written communication will focus on disseminating public health information in diverse formats, and will include a presentation and an honors thesis. Must be taken for a letter grade to be applied to the public health major. Prerequisites: FMPH 196B. Restricted to upper-division public health majors only (FP25).",
    "FMPH 198": "Investigation of public health topics through directed reading and discussion by a small group of students. Opportunities can also include experiential and research components. Study must be under supervision of a faculty member and approval must be secured from the faculty member prior to registering. P/NP grades only. May be taken for credit a combined total of nine times. Prerequisites: upper-division standing, completion of ninety units of UC San Diego undergraduate study, a minimum UC San Diego GPA of 2.5, consent of instructor, and a completed and approved Special Studies form.",
    "FMPH 199": "Individual undergraduate study or research not covered by the present course offerings. Study or research must be under the direction of a faculty member in the Department of Family Medicine and Public Health and approval must be secured from the faculty member prior to registering. P/NP grades only. Renumbered from FPMU 199. FMPH 199 and/or FPMU 199 may be taken for credit a combined total of nine times. Prerequisites: upper-division standing, completion of ninety units of UC San Diego undergraduate study, a minimum UC San Diego GPA of 2.5, consent of instructor, and a completed and approved Special Studies form.",
    "FMPH 221": "Introductory graduate course on the analysis of biomedical data using the R statistical software. Topics include t-tests, ANOVAs, linear regression, model diagnostics, model building and selection, interaction, confounding, multiple comparisons, and robust tests based on ranks and resampling. Prerequisites: biostatistics major or program approval.",
    "FMPH 222": "Intermediate-level graduate course in the analysis of categorical data. Topics include generalized linear models (logistic, Poisson, loglinear models); splines and nonlinear regression; stratified and case-control studies. Maximum likelihood, quasi likelihood, and Bayesian approaches; large scale model selection and inference. Prerequisites: successful completion of FMPH 221 and MATH 281A or MATH 282A or program approval.",
    "FMPH 223": "Covers analysis of longitudinal data, parametric modeling of covariance, generalized estimating equations, linear, nonlinear, and generalized linear mixed effects models and modeling dropout in longitudinal studies. Data analysis and computational issues are emphasized. Prerequisites: successful completion of FMPH 222 and MATH 281A and MATH 282A or MATH 281B and MATH 282B or program approval.",
    "FMPH 224": "The graduate class will cover statistical aspects of clinical trial design, monitoring, analysis, and ethics of human subjects research. Data analysis and computation will be emphasized. Prerequisites: successful completion of FMPH 221 and FMPH 222 or program approval.",
    "FMPH 225": "The graduate class will cover modern statistical inference including nonparametric statistics, estimating equations, resampling methods, and statistical learning. Data analysis and computation will be emphasized. Prerequisites: successful completion of FMPH 221, FMPH 222, and FMPH 223 or program approval.",
    "FMPH 226": "An introduction to inference and causal modeling for observational data, including propensity score adjustment, inverse probability weighting, instrumental variables, and sensitivity analysis. Data analysis and computation will be required. Prerequisites: successful completion of FMPH 221, FMPH 222, and FMPH 223 or program approval.",
    "FMPH 227": "This graduate course covers concepts, methods, and applications of multivariate data analysis, including multivariate regression, principal components, clustering and functional analysis. Data analysis will be emphasized. Prerequisites: successful completion of FMPH 221 and FMPH 222 or program approval.",
    "FMPH 241": "This practicum provides hand-on experience with biomedical research and data analysis. Working within a specific biomedical domain (e.g., cancer, genomics, or physical activity research), students will conduct original data analysis, and prepare or substantially contribute to a final project report. May be taken for credit up to five times. Prerequisites: successful completion of FMPH 221 and FMPH 222; biostatistics major only.",
    "FMPH 242": "Biostatistics elective courses will be taught under this course heading. Courses will have a varying focus each year/quarter. Topics will include random field theory and image analysis, advanced statistical computing, Bayesian methods, and others. May be taken for credit up to three times. Prerequisites: successful completion of FMPH 221 and FMPH 222 or program approval.",
    "FMPH 243A": "This is the first course in a three-course sequence specifically designed for students enrolled in the MS in biostatistics program. Takes advantage of the extensive involvement of the program faculty in collaborative and interdisciplinary work within the life sciences. Didactic instruction on best practices in statistical collaboration. Under supervision, the students will participate in applied, real-life projects stemming from the research and collaborations of the faculty in the Division of Biostatistics. Prerequisites: successful completion of FMPH 221. Restricted to major code FM76.",
    "FMPH 243B": "This is the second course in a three-course sequence specifically designed for students enrolled in the MS in biostatistics program. Takes advantage of the extensive involvement of the program faculty in collaborative and interdisciplinary work within the life sciences. Didactic instruction on best practices in statistical collaboration. Under supervision, the students will participate in applied, real-life projects stemming from the research and collaborations of the faculty in the Division of Biostatistics. Course corequisite: FMPH 222. Prerequisites: successful completion of FMPH 221 and FMPH 243A. Restricted to major code FM76.",
    "FMPH 243C": "This is the third course in a three-course sequence specifically designed for students enrolled in the MS in biostatistics program. Takes advantage of the extensive involvement of the program faculty in collaborative and interdisciplinary work within the life sciences. Didactic instruction on best practices in statistical collaboration. Under supervision, the students will participate in applied, real-life projects stemming from the research and collaborations of the faculty in the Division of Biostatistics. Course corequisite: FMPH 222. Prerequisites: successful completion of FMPH 221 and FMPH 243A. Restricted to major code FM76.",
    "FMPH 244A": "Overview of mathematical foundations in biostatistics. Probability, random variables, commonly used univariate and multivariate distributions, and their properties. Sampling distribution and large-sample convergence concepts. Applications to one-sample and two-sample problems, and to linear regression models. Prerequisites: biostatistics MS major (FM76) or program approval.",
    "FMPH 244B": "Continued overview of mathematical foundations in biostatistics. The second course in a two-course series. Maximum likelihood theory. Sufficiency, efficiency. Hypothesis testing and confidence intervals. Robustness and power. Large-sample properties of commonly-used estimation methods. Prerequisites: FMPH 244A, biostatistics MS major (FM76), or program approval.",
    "FMPH 277": "This course provides an overview of the US health policy landscape. It addresses the development of explicit health policies to promote certain health behaviors, policies aimed at public health safety, and policy issues related to emerging health and biomedical technologies. Renumbered from FPM 290. Students may not receive credit for FMPH 277 and FPM 290. Prerequisites: must be enrolled in the UC San Diego/SDSU Joint Doctoral Program in public health (PU75, PU76, and PU77), biostatistics major (FM77), or consent of instructor.",
    "FMPH 290": "This course requires attendance and participation in the Division of Biostatistics seminar series and journal club. Students will critically read the assigned articles and participate in biweekly journal clubs. Students are also required to lead at least one journal club discussion. Prerequisites: biostatistics major only.",
    "FILM 87": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students. Prerequisites: none.",
    "HUM 1": "Texts from the Hebrew Bible and from Greek epic, history, drama, and philosophy in their cultural context. Revelle students must take course for letter grade. Prerequisites: satisfaction of the UC Entry Level Writing requirement.",
    "HUM 2": "The Roman Empire, the Christian transformation of the classical world in late antiquity, and the rise of a European culture during the Middle Ages. Representative texts from Latin authors, early Christian literature, the Germanic tradition, and the high Middle Ages. Revelle students must take course for letter grade. Prerequisites: satisfaction of the UC Entry Level Writing requirement.",
    "HUM 3": "The revival of classical culture and values and the reaction against medieval ideas concerning the place of human beings in the world. The Protestant Reformation and its intellectual and political consequences. The philosophical background to the scientific revolution. Revelle students must take the course for a letter grade. Students may not receive credit for HUM 3 and HUM 3GS. Prerequisites: completion of HUM 1 or HUM 2.",
    "HUM 3GS": "The revival of classical culture and values and the reaction against medieval ideas concerning the place of human beings in the world. The Protestant Reformation and its intellectual and political consequences. The philosophical background to the scientific revolution. Revelle students must take the course for a letter grade. Students may not receive credit for HUM 3 and 3GS. Prerequisites: acceptance into Global Seminar Program.",
    "HUM 4": "The Enlightenment’s revisions of traditional thought; the rise of classical liberalism; the era of the first modern political revolutions; Romantic ideas of nature and human life. Revelle students must take course for letter grade. Students may receive credit for one of the following: HUM 4, HUM 4R, or HUM 4GS. Prerequisites: satisfaction of the UC Entry Level Writing requirement.",
    "INTL 97": "Independent research connected to an internship with an organization relevant to the career interests of a student of international studies. Topic of the required research to be determined by the supervising faculty member. P/NP grades only. May be taken for credit eight times. Prerequisites: department approval required.",
    "INTL 100": "Focuses on developing skills in analytic reading and writing while using an interdisciplinary approach to asking and answering real-world questions. Lectures are topical and built around a series of readings that build in complexity and nuance; students work in an iterative process that builds toward a final policy memo project. Prerequisites: sophomore standing or above and completion of at least one quarter of a university-level writing course.",
    "INTL 101": "Analysis of the cultural and social development of the modern era from the perspective of interaction among societies. Particular attention is paid to the definition, representation, and negotiation of social and cultural boundaries over time. Prerequisites: completion of INTL 100 with a grade of C– or better.",
    "INTL 102": "Examination of the domestic and international sources of economic and political change. Topics include the rise of the nation-state, comparative economic development, authoritarian and democratic regimes, international and civil conflict, globalization and its domestic and international implications. Prerequisites: completion of INTL 100 with a grade of C– or better.",
    "INTL 190": "Readings and discussion of topics in international and comparative studies from an interdisciplinary perspective. Emphasis on independent work and completion of a research paper. Prerequisites: open to international studies majors only; successful completion with a C– or better of INTL 100, INTL 101, and 102.",
    "INTL 190H": "Required of all honors students in International Studies. Reading and discussion of topics in international and comparative studies from an interdisciplinary perspective. Emphasis on research design and completion of research paper in preparation for INTL 196H. Prerequisites: international studies major with 3.5 major GPA; department application process required; senior standing; INTL 100; INTL 101; INTL 102.",
    "INTL 196H": "Open only to seniors who have completed INTL 190H. Completion of an honors thesis under the supervision of a member of the International Studies faculty. Prerequisites: international studies major with 3.5 major GPA; department approval; senior standing; INTL 190H.",
    "INTL 197": "Independent research connected to an internship with an organization relevant to the career interests of a student of international studies. Topic of the required research to be determined by the supervising faculty member. P/NP grades only. May be taken for credit eight times. Prerequisites: department approval required; junior and senior standing.",
    "LAWS 101": "This course will deal in depth each year with a different legal issue of contemporary significance, viewed from the perspectives of political science, history, sociology, and philosophy. Required for students completing the Law and Society minor. May be repeated for credit once, for a maximum total of eight units. Prerequisites: upper-division standing or consent of instructor.",
    "LAWS 102S": "Through lectures and discussions on several controversial topics, students are introduced to the subjects taught in the first year of law school. They learn briefing, case analysis, and the Socratic method of instruction, engage in role-playing exercises, and take law-school examinations. Prerequisites: upper-division standing or consent of instructor.",
    "SIO 295S": "Lectures on ecological, economic, social, and legal issues related to marine biodiversity and case studies on socioeconomic and legal issues. Students are expected to attend field trips at sea and to various sites around San Diego County as part of the corequisite course. Students who have taken SIO 295 may not receive credit for SIO 295S. Prerequisites: consent of instructors. Corequisites: SIO 295LS and MAS students only.",
    "SIO 295LS": "Laboratory work on major biological taxa, field trips on biodiversity in situ, computer labs for informatic tools. Students are expected to attend field trips at sea and to various sites around San Diego County as part of the course. Students who have taken SIO 295L may not receive credit for SIO 295LS. Prerequisites: consent of instructor. Corequisites: SIO 295S and MAS students only.",
    "MBC 258": "This is the first of two required courses in a sequence for MAS-MBC students, which focuses on generation and refinement of MAS-MBC Capstone Projects, professional networking, and development of critical technical and practical skills. Students broaden understanding of and discuss complex political, social, economic, and historical issues related to marine conservation, give peer feedback on Capstone ideas, and interact with MBC leadership and invited guests. May be taken for credit three times. Prerequisites: SIO 295S and SIO 295LS summer courses. Limited to registered students in MAS Marine Biodiversity and Conservation program.",
    "MBC 259": "This is the culmination of a required two-course sequence for MAS-MBC students, which focuses on continued refinement of MAS-MBC Capstone Projects, professional networking, and development of critical technical and practical skills. Students deepen understanding of and discuss complex political, social, economic, and historical issues related to marine conservation, give peer feedback on Capstone ideas, and interact with MBC leadership and invited guests. May be taken for credit three times. Prerequisites: MBC 258. Limited to registered students in MAS Marine Biodiversity and Conservation program.",
    "MBC 296": "Building on knowledge and experience gained in the MAS Program in Marine Biodiversity and Conservation, students will design and execute a complex, interdisciplinary marine or coastal conservation project with a theoretical grounding and real-world application. This self-directed project will consider varied worldviews and perspectives and add value to the current seascape of marine biodiversity and conservation. Students will present final deliverables in an annual Capstone Symposium in June. Prerequisites: SIOB 258. MBC 296 is restricted to students in the Master of Advanced Studies—Marine Biodiversity and Conservation Program (SI83).",
    "MATH 2": "A highly adaptive course designed to build on students’ strengths while increasing overall mathematical understanding and skill. This multimodality course will focus on several topics of study designed to develop conceptual understanding and mathematical relevance: linear relationships; exponents and polynomials; rational expressions and equations; models of quadratic and polynomial functions and radical equations; exponential and logarithmic functions; and geometry and trigonometry. Workload credit only—not for baccalaureate credit. Prerequisites: Math Placement Exam qualifying score.",
    "MATH 3B": "Introduction to functions and their properties. Polynomial and rational functions. Exponential and logarithmic functions. Trigonometric functions and their properties. Prerequisites: Math Placement Exam qualifying score, or MATH 2.",
    "MATH 3C": "Functions and their graphs. Linear and polynomial functions, zeroes, inverse functions, exponential and logarithmic, trigonometric functions and their inverses. Emphasis on understanding algebraic, numerical, and graphical. (No credit given if taken after MATH 4C, 1A/10A, or 2A/20A.) Three or more years of high school mathematics or equivalent recommended. Prerequisites: Math Placement Exam qualifying score or MATH 3B.",
    "MATH 4C": "Review of polynomials. Graphing functions and relations: graphing rational functions, effects of linear changes of coordinates. Circular functions and right triangle trigonometry. Reinforcement of function concept: exponential, logarithmic, and trigonometric functions. Vectors. Conic sections. Polar coordinates. (No credit given if taken after MATH 1A/10A or 2A/20A. Two units of credit given if taken after MATH 3C.) Three or more years of high school mathematics or equivalent recommended. Prerequisites: Math Placement Exam qualifying score, or MATH 3C, or ACT Math score of 25 or higher, or AP Calculus AB score (or subscore) of 2.",
    "MATH 10A": "Differential calculus of functions of one variable, with applications. Functions, graphs, continuity, limits, derivatives, tangent lines, optimization problems. (No credit given if taken after or concurrent with MATH 20A.) Prerequisites: Math Placement Exam qualifying score, or AP Calculus AB score of 2, or SAT II Math Level 2 score of 600 or higher, or MATH 3C, or MATH 4C.",
    "MATH 10B": "Integral calculus of functions of one variable, with applications. Antiderivatives, definite integrals, the Fundamental Theorem of Calculus, methods of integration, areas and volumes, separable differential equations. (No credit given if taken after or concurrent with MATH 20B.) Prerequisites: AP Calculus AB score of 3, 4, or 5 (or equivalent AB subscore on BC exam), or MATH 10A, or MATH 20A.",
    "MATH 10C": "Introduction to functions of more than one variable. Vector geometry, partial derivatives, velocity and acceleration vectors, optimization problems. (No credit given if taken after or concurrent with 20C.) Prerequisites: AP Calculus BC score of 3, 4, or 5, or MATH 10B, or MATH 20B.",
    "MATH 11": "Events and probabilities, conditional probability, Bayes’ formula. Discrete and continuous random variables: mean, variance; binomial, Poisson distributions, normal, uniform, exponential distributions, central limit theorem. Sample statistics, confidence intervals, hypothesis testing, regression. Applications. Introduction to software for probabilistic and statistical analysis. Emphasis on connections between probability and statistics, numerical results of real data, and techniques of data analysis.  Prerequisites: AP Calculus BC score of 3, 4, or 5, or MATH 10B or MATH 20B.",
    "MATH 15A": "Basic discrete mathematical structure: sets, relations, functions, sequences, equivalence relations, partial orders, and number systems. Methods of reasoning and proofs: propositional logic, predicate logic, induction, recursion, and pigeonhole principle. Infinite sets and diagonalization. Basic counting techniques; permutation and combinations. Applications will be given to digital logic design, elementary number theory, design of programs, and proofs of program correctness. Students who have completed MATH 109 may not receive credit for MATH 15A. Credit not offered for both MATH 15A and CSE 20. Equivalent to CSE 20. Prerequisites: CSE 8B or CSE 11. Prerequisite courses must be completed with a grade of C– or better.",
    "MATH 18": "Matrix algebra, Gaussian elimination, determinants. Linear and affine subspaces, bases of Euclidean spaces. Eigenvalues and eigenvectors, quadratic forms, orthogonal matrices, diagonalization of symmetric matrices. Applications. Computing symbolic and graphical solutions using MATLAB. Students may not receive credit for both MATH 18 and 31AH. Prerequisites: Math Placement Exam qualifying score, or AP Calculus AB score of 3 (or equivalent AB subscore on BC exam), or SAT II Math Level 2 score of 650 or higher, or MATH 4C, or MATH 10A, or MATH 20A. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 20A": "Foundations of differential and integral calculus of one variable. Functions, graphs, continuity, limits, derivative, tangent line. Applications with algebraic, exponential, logarithmic, and trigonometric functions. Introduction to the integral. (Two credits given if taken after MATH 1A/10A and no credit given if taken after MATH 1B/10B or MATH 1C/10C. Formerly numbered MATH 2A.) Prerequisites: Math Placement Exam qualifying score, or AP Calculus AB score of 3 (or equivalent AB subscore on BC exam), or SAT II MATH 2C score of 650 or higher, or MATH 4C or MATH 10A.",
    "MATH 20B": "Integral calculus of one variable and its applications, with exponential, logarithmic, hyperbolic, and trigonometric functions. Methods of integration. Infinite series. Polar coordinates in the plane and complex exponentials. (Two units of credits given if taken after MATH 1B/10B or MATH 1C/10C.) Prerequisites: AP Calculus AB score of 4 or 5, or AP Calculus BC score of 3, or MATH 20A with a grade of C– or better, or MATH 10B with a grade of C– or better, or MATH 10C with a grade of C– or better.",
    "MATH 20C": "Vector geometry, vector functions and their derivatives. Partial differentiation. Maxima and minima. Double integration. (Two units of credit given if taken after MATH 10C. Credit not offered for both MATH 20C and 31BH. Formerly numbered MATH 21C.) Prerequisites: AP Calculus BC score of 4 or 5, or MATH 20B with a grade of C– or better.",
    "MATH 20D": "Ordinary differential equations: exact, separable, and linear; constant coefficients, undetermined coefficients, variations of parameters. Systems. Series solutions. Laplace transforms. Techniques for engineering sciences. Computing symbolic and graphical solutions using MATLAB. (Formerly numbered MATH 21D.) May be taken as repeat credit for MATH 21D. Prerequisites: MATH 20C (or MATH 21C) or MATH 31BH with a grade of C– or better.",
    "MATH 20E": "Change of variable in multiple integrals, Jacobian, Line integrals, Green’s theorem. Vector fields, gradient fields, divergence, curl. Spherical/cylindrical coordinates. Taylor series in several variables. Surface integrals, Stoke’s theorem. Gauss’ theorem. Conservative fields. Prerequisites: MATH 18 or MATH 20F or MATH 31AH and MATH 20C (or MATH 21C) or MATH 31BH with a grade of C– or better.",
    "MATH 31AH": "First quarter of three-quarter honors integrated linear algebra/multivariable calculus sequence for well-prepared students. Topics include real/complex number systems, vector spaces, linear transformations, bases and dimension, change of basis, eigenvalues, eigenvectors, diagonalization. (Credit not offered for both MATH 31AH and 20F.) Prerequisites: AP Calculus BC score of 5 or consent of instructor.",
    "MATH 31BH": "Second quarter of three-quarter honors integrated linear algebra/multivariable calculus sequence for well-prepared students. Topics include derivative in several variables, Jacobian matrices, extrema and constrained extrema, integration in several variables. (Credit not offered for both MATH 31BH and 20C.) Prerequisites: MATH 31AH with a grade of B– or better, or consent of instructor.",
    "MATH 31CH": "Third quarter of honors integrated linear algebra/multivariable calculus sequence for well-prepared students. Topics include change of variables formula, integration of differential forms, exterior derivative, generalized Stoke’s theorem, conservative vector fields, potentials. Prerequisites: MATH 31BH with a grade of B– or better, or consent of instructor.",
    "MATH 87": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students. Prerequisites: none.",
    "MATH 95": "(Cross-listed with EDS 30.) Revisit students’ learning difficulties in mathematics in more depth to prepare students to make meaningful observations of how K–12 teachers deal with these difficulties. Explore how instruction can use students’ knowledge to pose problems that stimulate students’ intellectual curiosity. Prerequisites: none.",
    "MATH 96": "Students will develop skills in analytical thinking as they solve and present solutions to challenging mathematical problems in preparation for the William Lowell Putnam Mathematics Competition, a national undergraduate mathematics examination held each year. Students must sit for at least one half of the Putnam exam (given the first Saturday in December) to receive a passing grade. P/NP grades only. May be taken for credit up to four times. Prerequisites: AP Calculus AB score of 4 or more, or AP Calculus BC score of 3 or more, or MATH 20A.",
    "MATH 99R": "Independent study or research under direction of a member of the faculty. Prerequisites: Must be of first-year standing and a Regent’s Scholar.",
    "MATH 100A": "First course in a rigorous three-quarter introduction to the methods and basic structures of higher algebra. Topics include groups, subgroups and factor groups, homomorphisms, rings, fields. (Students may not receive credit for both MATH 100A and MATH 103A.) Prerequisites: MATH 31CH or MATH 109 or consent of instructor.",
    "MATH 100B": "Second course in a rigorous three-quarter introduction to the methods and basic structures of higher algebra. Topics include rings (especially polynomial rings) and ideals, unique factorization, fields; linear algebra from perspective of linear transformations on vector spaces, including inner product spaces, determinants, diagonalization. (Students may not receive credit for both MATH 100B and MATH 103B.) Prerequisites: MATH 100A or consent of instructor.",
    "MATH 100C": "Third course in a rigorous three-quarter introduction to the methods and basic structures of higher algebra. Topics include linear transformations, including Jordan canonical form and rational canonical form; Galois theory, including the insolvability of the quintic. Prerequisites: MATH 100B or consent of instructor.",
    "MATH 102": "Second course in linear algebra from a computational yet geometric point of view. Elementary Hermitian matrices, Schur’s theorem, normal matrices, and quadratic forms. Moore-Penrose generalized inverse and least square problems. Vector and matrix norms. Characteristic and singular values. Canonical forms. Determinants and multilinear algebra. Prerequisites: MATH 18 or MATH 20F or MATH 31AH and MATH 20C. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 103A": "First course in a two-quarter introduction to abstract algebra with some applications. Emphasis on group theory. Topics include definitions and basic properties of groups, properties of isomorphisms, subgroups. (Students may not receive credit for both MATH 100A and MATH 103A.) Prerequisites: MATH 31CH or MATH 109 or consent of instructor.",
    "MATH 103B": "Second course in a two-quarter introduction to abstract algebra with some applications. Emphasis on rings and fields. Topics include definitions and basic properties of rings, fields, and ideals, homomorphisms, irreducibility of polynomials. (Students may not receive credit for both MATH 100B and MATH 103B.) Prerequisites: MATH 103A or MATH 100A or consent of instructor.",
    "MATH 104A": "Elementary number theory with applications. Topics include unique factorization, irrational numbers, residue systems, congruences, primitive roots, reciprocity laws, quadratic forms, arithmetic functions, partitions, Diophantine equations, distribution of primes. Applications include fast Fourier transform, signal processing, codes, cryptography. Prerequisites: MATH 100B or MATH 103B. Students who have not completed the listed prerequisite(s) may enroll with consent of instructor.",
    "MATH 104B": "Topics in number theory such as finite fields, continued fractions, Diophantine equations, character sums, zeta and theta functions, prime number theorem, algebraic integers, quadratic and cyclotomic fields, prime ideal theory, class number, quadratic forms, units, Diophantine approximation, p-adic numbers, elliptic curves. Prerequisites: MATH 104A or consent of instructor.",
    "MATH 105": "The course will cover the basic arithmetic properties of the integers, with applications to Diophantine equations and elementary Diophantine approximation theory. Prerequisites: MATH 31CH or MATH 109. Students who have not completed the listed prerequisites may enroll with consent of instructor.",
    "MATH 106": "Plane curves, Bezout’s theorem, singularities of plane curves. Affine and projective spaces, affine and projective varieties. Examples of all the above. Instructor may choose to include some commutative algebra or some computational examples. Prerequisites: MATH 100B or MATH 103B. Students who have not completed the listed prerequisites may enroll with consent of instructor.",
    "MATH 109": "This course uses a variety of topics in mathematics to introduce the students to rigorous mathematical proof, emphasizing quantifiers, induction, negation, proof by contradiction, naive set theory, equivalence relations and epsilon-delta proofs. Required of all departmental majors. Prerequisites: MATH 18 or MATH 20F or MATH 31AH, and MATH 20C. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 110": "An introduction to partial differential equations focusing on equations in two variables. Topics include the heat and wave equation on an interval, Laplace’s equation on rectangular and circular domains, separation of variables, boundary conditions and eigenfunctions, introduction to Fourier series, software methods for solving equations. Formerly MATH 110A. (Students may not receive credit for MATH 110 and MATH 110A.) Prerequisites: MATH 18 or MATH 20F or MATH 31AH and MATH 20D and MATH 20E or MATH 31CH. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 111A": "An introduction to mathematical modeling in the physical and social sciences. Topics vary, but have included mathematical models for epidemics, chemical reactions, political organizations, magnets, economic mobility, and geographical distributions of species. May be taken for credit two times when topics change. Prerequisites: MATH 20D, MATH 18 or MATH 20F or MATH 31AH, and MATH 109 or MATH 31CH. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 111B": "Continued study on mathematical modeling in the physical and social sciences, using advanced techniques that will expand upon the topics selected and further the mathematical theory presented in MATH 111A. Prerequisites: MATH 111A or consent of instructor.",
    "MATH 112A": "Part one of a two-course introduction to the use of mathematical theory and techniques in analyzing biological problems. Topics include differential equations, dynamical systems, and probability theory applied to a selection of biological problems from population dynamics, biochemical reactions, biological oscillators, gene regulation, molecular interactions, and cellular function. May be coscheduled with MATH 212A. Recommended preparation: MATH 130 and MATH 180A. Prerequisites: MATH 11 or MATH 180A or MATH 183 or MATH 186, and MATH 18 or MATH 31AH, and MATH 20D, and BILD 1. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 112B": "Part two of an introduction to the use of mathematical theory and techniques in analyzing biological problems. Topics include partial differential equations and stochastic processes applied to a selection of biological problems, especially those involving spatial movement, such as molecular diffusion, bacterial chemotaxis, tumor growth, and biological patterns. May be coscheduled with MATH 212B. Recommended preparation: MATH 180B. Prerequisites: MATH 112A and MATH 110 and MATH 180A. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 114": "Topics include random number generators, variance reduction, Monte Carlo (including Markov Chain Monte Carlo) simulation, and numerical methods for stochastic differential equations. Methods will be illustrated on applications in biology, physics, and finance. May be coscheduled with MATH 214. Recommended preparation: CSE 5A, CSE 8A, CSE 11, or ECE 15. Students should complete a computer programming course before enrolling in MATH 114. Prerequisites: MATH 180A. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 120A": "Complex numbers and functions. Analytic functions, harmonic functions, elementary conformal mappings. Complex integration. Power series. Cauchy’s theorem. Cauchy’s formula. Residue theorem. Prerequisites: MATH 20E or MATH 31CH, or consent of instructor.",
    "MATH 120B": "Applications of the residue theorem. Conformal mapping and applications to potential theory, flows, and temperature distributions. Fourier transformations. Laplace transformations, and applications to integral and differential equations. Selected topics such as Poisson’s formula, Dirichlet’s problem, Neumann’s problem, or special functions. Prerequisites: MATH 120A or consent of instructor.",
    "MATH 121A": "(Cross-listed with EDS 121A.) Develop teachers’ knowledge base (knowledge of mathematics content, pedagogy, and student learning) in the context of advanced mathematics. This course builds on the previous courses where these components of knowledge were addressed exclusively in the context of high-school mathematics. Prerequisites: EDS 30/MATH 95, Calculus 10C or 20C.",
    "MATH 121B": "(Cross-listed with EDS 121B.) Examine how learning theories can consolidate observations about conceptual development with the individual student as well as the development of knowledge in the history of mathematics. Examine how teaching theories explain the effect of teaching approaches addressed in the previous courses. Prerequisites: EDS 121A/MATH 121A.",
    "MATH 130": "An introduction to ordinary differential equations from the dynamical systems perspective. Topics include flows on lines and circles, two-dimensional linear systems and phase portraits, nonlinear planar systems, index theory, limit cycles, bifurcation theory, applications to biology, physics, and electrical engineering. Formerly MATH 130A. (Students may not receive credit for MATH 130 and MATH 130A.) Prerequisites: MATH 18 or MATH 20F or MATH 31AH and MATH 20D. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 140A": "First course in a rigorous three-quarter sequence on real analysis. Topics include the real number system, basic topology, numerical sequences and series, continuity. (Students may not receive credit for both MATH 140A and MATH 142A.) Prerequisites: MATH 31CH or MATH 109. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 140B": "Second course in a rigorous three-quarter sequence on real analysis. Topics include differentiation, the Riemann-Stieltjes integral, sequences and series of functions, power series, Fourier series, and special functions. (Students may not receive credit for both MATH 140B and MATH 142B.) Prerequisites: MATH 140A or consent of instructor.",
    "MATH 140C": "Third course in a rigorous three-quarter sequence on real analysis. Topics include differentiation of functions of several real variables, the implicit and inverse function theorems, the Lebesgue integral, infinite-dimensional normed spaces. Prerequisites: MATH 140B or consent of instructor.",
    "MATH 142A": "First course in an introductory two-quarter sequence on analysis. Topics include the real number system, numerical sequences and series, infinite limits, limits of functions, continuity, differentiation. Students may not receive credit for MATH 142A if taken after or concurrently with MATH 140A. Prerequisites: MATH 31CH or MATH 109. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 142B": "Second course in an introductory two-quarter sequence on analysis. Topics include the Riemann integral, sequences and series of functions, uniform convergence, Taylor series, introduction to analysis in several variables. Students may not receive credit for MATH 142B if taken after or concurrently with MATH 140B. Prerequisites: MATH 142A or MATH 140A. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 144": "Rigorous introduction to the theory of Fourier series and Fourier transforms. Topics include basic properties of Fourier series, mean square and pointwise convergence, Hilbert spaces, applications of Fourier series, the Fourier transform on the real line, inversion formula, Plancherel formula, Poisson summation formula, Heisenberg uncertainty principle, applications of the Fourier transform. Prerequisites: MATH 140B or MATH 142B. Students who have not completed listed prerequisite(s) may enroll with the consent of instructor.",
    "MATH 146": "A rigorous introduction to systems of ordinary differential equations. Topics include linear systems, matrix diagonalization and canonical forms, matrix exponentials, nonlinear systems, existence and uniqueness of solutions, linearization, and stability. Prerequisites: MATH 140B or MATH 142B. Students who have not completed listed prerequisite(s) may enroll with the consent of instructor.",
    "MATH 148": "A rigorous introduction to partial differential equations. Topics include initial and boundary value problems; first order linear and quasilinear equations, method of characteristics; wave and heat equations on the line, half-line, and in space; separation of variables for heat and wave equations on an interval and for Laplace’s equation on rectangles and discs; eigenfunctions of the Laplacian and heat, wave, Poisson’s equations on bounded domains; and Green’s functions and distributions. Prerequisites: MATH 140B or MATH 142B. Students who have not completed listed prerequisite(s) may enroll with the consent of instructor.",
    "MATH 150A": "Differential geometry of curves and surfaces. Gauss and mean curvatures, geodesics, parallel displacement, Gauss-Bonnet theorem. Prerequisites: MATH 20E or MATH 31CH and either MATH 18 or MATH 20F or MATH 31AH. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 150B": "Calculus of functions of several variables, inverse function theorem. Further topics may include exterior differential forms, Stokes’ theorem, manifolds, Sard’s theorem, elements of differential topology, singularities of maps, catastrophes, further topics in differential geometry, topics in geometry of physics. Prerequisites: MATH 150A or consent of instructor.",
    "MATH 152": "This course will give students experience in applying theory to real world applications such as internet and wireless communication problems. The course will incorporate talks by experts from industry and students will be helped to carry out independent projects. Topics include graph visualization, labelling, and embeddings, random graphs and randomized algorithms. May be taken for credit three times. Prerequisites: MATH 20D and either MATH 18 or MATH 20F or MATH 31AH. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 153": "Two- and three-dimensional Euclidean geometry is developed from one set of axioms. Pedagogical issues will emerge from the mathematics and be addressed using current research in teaching and learning geometry. This course is designed for prospective secondary school mathematics teachers. Prerequisites: MATH 109 or MATH 31CH, or consent of instructor.",
    "MATH 154": "Basic concepts in graph theory, including trees, walks, paths, and connectivity, cycles, matching theory, vertex and edge-coloring, planar graphs, flows and combinatorial algorithms, covering Hall’s theorems, the max-flow min-cut theorem, Euler’s formula, and the travelling salesman problem. Credit not offered for MATH 154 if MATH 158 is previously taken. If MATH 154 and MATH 158 are concurrently taken, credit is only offered for MATH 158. Prerequisites: MATH 31CH or MATH 109. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 155A": "Bezier curves and control lines, de Casteljau construction for subdivision, elevation of degree, control points of Hermite curves, barycentric coordinates, rational curves. Programming knowledge recommended. (Students may not receive credit for both MATH 155A and CSE 167.) Prerequisites: MATH 18 or MATH 20F or MATH 31AH, and MATH 20C. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 155B": "Spline curves, NURBS, knot insertion, spline interpolation, illumination models, radiosity, and ray tracing. Prerequisites: MATH 155A. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 157": "This course provides a hands-on introduction to the use of a variety of open-source mathematical software packages, as applied to a diverse range of topics within pure and applied mathematics. Most of these packages are built on the Python programming language, but experience with another common programming language is acceptable. All software will be accessed using the CoCalc web platform (http://cocalc.com), which provides a uniform interface through any web browser. Students will need to bring a laptop or tablet to lectures in order to participate in interactive presentations. Students should have exposure to one of the following programming languages: C, C++, Java, Python, R. Prerequisites: MATH 18 or MATH 20F or MATH 31AH and one of BILD 62, COGS 18 or CSE 5A or CSE 6R or CSE 8A or CSE 11 or DSC 10 or ECE 15 or ECE 143 or MATH 189. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 158": "Extremal combinatorics is the study of how large or small a finite set can be under combinatorial restrictions. We will give an introduction to graph theory, connectivity, coloring, factors, and matchings, extremal graph theory, Ramsey theory, extremal set theory, and an introduction to probabilistic combinatorics. Topics include Turan’s theorem, Ramsey’s theorem, Dilworth’s theorem, and Sperner’s theorem. Credit not offered for MATH 158 if MATH 154 was previously taken. If MATH 154 and MATH 158 are concurrently taken, credit is only offered for MATH 158. A strong performance in MATH 109 or MATH 31CH is recommended. Prerequisites: MATH 31CH or MATH 109. Students who have not completed the listed prerequisites may enroll with consent of instructor.",
    "MATH 160A": "An introduction to recursion theory, set theory, proof theory, model theory. Turing machines. Undecidability of arithmetic and predicate logic. Proof by induction and definition by recursion. Cardinal and ordinal numbers. Completeness and compactness theorems for propositional and predicate calculi. Prerequisites: MATH 100A, or MATH 103A, or MATH 140A, or consent of instructor.",
    "MATH 160B": "A continuation of recursion theory, set theory, proof theory, model theory. Turing machines. Undecidability of arithmetic and predicate logic. Proof by induction and definition by recursion. Cardinal and ordinal numbers. Completeness and compactness theorems for propositional and predicate calculi. Prerequisites: MATH 160A or consent of instructor.",
    "MATH 163": "Topics will vary from year to year in areas of mathematics and their development. Topics may include the evolution of mathematics from the Babylonian period to the eighteenth century using original sources, a history of the foundations of mathematics and the development of modern mathematics. Prerequisites: MATH 20B or consent of instructor.",
    "MATH 168A": "Topics to be chosen in areas of applied mathematics and mathematical aspects of computer science. May be taken for credit two times with different topics. Prerequisites: MATH 18 or MATH 20F or MATH 31AH, and MATH 20C. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 170A": "This course covers analysis of numerical methods for linear algebraic systems and least squares problems. Topics include orthogonalization methods. Ill conditioned problems. Eigenvalue and singular value computations. Knowledge of programming recommended. Prerequisites: MATH 18 or MATH 31AH, and MATH 20C or MATH 31BH and CSE 20 or MATH 15A or MATH 31CH or MATH 109. Students who have not completed the listed prerequisites may enroll with consent of instructor.",
    "MATH 170B": "Rounding and discretization errors. Calculation of roots of polynomials and nonlinear equations. Interpolation. Approximation of functions. Knowledge of programming recommended. Prerequisites: MATH 170A.",
    "MATH 170C": "Numerical differentiation and integration. Ordinary differential equations and their numerical solution. Basic existence and stability theory. Difference equations. Boundary value problems. Prerequisites: MATH 20D or 21D and MATH 170B, or consent of instructor.",
    "MATH 171A": "Linear optimization and applications. Linear programming, the simplex method, duality. Selected topics from integer programming, network flows, transportation problems, inventory problems, and other applications. Three lectures, one recitation. Knowledge of programming recommended. (Credit not allowed for both MATH 171A and ECON 172A.) Prerequisites: MATH 18 or MATH 20F or MATH 31AH, and MATH 20C. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 171B": "Convergence of sequences in Rn, multivariate Taylor series. Bisection and related methods for nonlinear equations in one variable. Newton’s methods for nonlinear equations in one and many variables. Unconstrained optimization and Newton’s method. Equality-constrained optimization, Kuhn-Tucker theorem. Inequality-constrained optimization. Three lectures, one recitation. Knowledge of programming recommended. (Credit not allowed for both MATH 171B and ECON 172B.) Prerequisites: MATH 20C or MATH 31BH and MATH 171A or consent of instructor.",
    "MATH 173A": "Introduction to convexity: convex sets, convex functions; geometry of hyperplanes; support functions for convex sets; hyperplanes and support vector machines. Linear and quadratic programming: optimality conditions; duality; primal and dual forms of linear support vector machines; active-set methods; interior methods. Prerequisites: MATH 20C or MATH 31BH and MATH 18 or 20F or 31AH. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 173B": "Unconstrained optimization: linear least squares; randomized linear least squares; method(s) of steepest descent; line-search methods; conjugate-gradient method; comparing the efficiency of methods; randomized/stochastic methods; nonlinear least squares; norm minimization methods. Convex constrained optimization: optimality conditions; convex programming; Lagrangian relaxation; the method of multipliers; the alternating direction method of multipliers; minimizing combinations of norms. Prerequisites: MATH 173A. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 174": "(Conjoined with MATH 274.) Floating point arithmetic, direct and iterative solution of linear equations, iterative solution of nonlinear equations, optimization, approximation theory, interpolation, quadrature, numerical methods for initial and boundary value problems in ordinary differential equations. (Students may not receive credit for both MATH 174 and PHYS 105, AMES 153 or 154. Students may not receive credit for MATH 174 if MATH 170A, B, or C has already been taken.) Graduate students will do an extra assignment/exam. Prerequisites: Math 20D or MATH 21D, and either MATH 20F or MATH 31AH, or consent of instructor.",
    "MATH 175": "(Conjoined with MATH 275.) Mathematical background for working with partial differential equations. Survey of finite difference, finite element, and other numerical methods for the solution of elliptic, parabolic, and hyperbolic partial differential equations. (Formerly MATH 172. Students may not receive credit for MATH 175/275 and MATH 172.) Graduate students do an extra paper, project, or presentation, per instructor. Prerequisites: MATH 174 or MATH 274, or consent of instructor.",
    "MATH 179": "(Conjoined with MATH 279.) Mathematical models of physical systems arising in science and engineering, good models and well-posedness, numerical and other approximation techniques, solution algorithms for linear and nonlinear approximation problems, scientific visualizations, scientific software design and engineering, project-oriented. Graduate students will do an extra paper, project, or presentation per instructor. Prerequisites: MATH 174 or MATH 274 or consent of instructor.",
    "MATH 180A": "Probability spaces, random variables, independence, conditional probability, distribution, expectation, variance, joint distributions, central limit theorem. (Two units of credit offered for MATH 180A if ECON 120A previously, no credit offered if ECON 120A concurrently. Two units of credit offered for MATH 180A if MATH 183 or 186 taken previously or concurrently.) Prior or concurrent enrollment in MATH 109 is highly recommended.  Prerequisites: Math 20C or MATH 31BH, or consent of instructor.",
    "MATH 180B": "Random vectors, multivariate densities, covariance matrix, multivariate normal distribution. Random walk, Poisson process. Other topics if time permits. Prerequisites: MATH 20D and either MATH 18 or MATH 20F or MATH 31AH, and MATH 109 or MATH 31CH, and MATH 180A. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 180C": "Markov chains in discrete and continuous time, random walk, recurrent events. If time permits, topics chosen from stationary normal processes, branching processes, queuing theory. Prerequisites: MATH 180B or consent of instructor.",
    "MATH 181A": "Multivariate distribution, functions of random variables, distributions related to normal. Parameter estimation, method of moments, maximum likelihood. Estimator accuracy and confidence intervals. Hypothesis testing, type I and type II errors, power, one-sample t-test. Prior or concurrent enrollment in MATH 109 is highly recommended.  Prerequisites: MATH 180A, and MATH 18 or MATH 20F or MATH 31AH, and MATH 20C. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 181B": "Hypothesis testing. Linear models, regression, and analysis of variance. Goodness of fit tests. Nonparametric statistics. Two units of credit offered for MATH 181B if ECON 120B previously; no credit offered if ECON 120B concurrently. Prior enrollment in MATH 109 is highly recommended. Prerequisites: MATH 181A or consent of instructor.",
    "MATH 181C": "Topics covered may include the following: classical rank test, rank correlations, permutation tests, distribution free testing, efficiency, confidence intervals, nonparametric regression and density estimation, resampling techniques (bootstrap, jackknife, etc.) and cross validations. Prior enrollment in MATH 109 is highly recommended. Prerequisites: MATH 181B or consent of instructor.",
    "MATH 181D": "Statistical learning refers to a set of tools for modeling and understanding complex data sets. It uses developments in optimization, computer science, and in particular machine learning. This encompasses many methods such as dimensionality reduction, sparse representations, variable selection, classification, boosting, bagging, support vector machines, and machine learning. Prerequisites: ECE 109 or ECON 120A or MAE 108 or MATH 181A or MATH 183 or MATH 186 or MATH 189. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 181E": "Analysis of trends and seasonal effects, autoregressive and moving averages models, forecasting, informal introduction to spectral analysis. Prerequisites: MATH 181B or consent of instructor.",
    "MATH 181F": "Design of sampling surveys: simple, stratified, systematic, cluster, network surveys. Sources of bias in surveys. Estimators and confidence intervals based on unequal probability sampling. Design and analysis of experiments: block, factorial, crossover, matched-pairs designs. Analysis of variance, re-randomization, and multiple comparisons. Prerequisites: ECE 109 or ECON 120A or MAE 108 or MATH 11 or MATH 181A or MATH 183 or MATH 186 or MATH 189. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 182": "Rigorous treatment of principal component analysis, one of the most effective methods in finding signals amidst the noise of large data arrays. Topics include singular value decomposition for matrices, maximal likelihood estimation, least squares methods, unbiased estimators, random matrices, Wigner’s semicircle law, Markchenko-Pastur laws, universality of eigenvalue statistics, outliers, the BBP transition, applications to community detection, and stochastic block model. Students will not receive credit for both MATH 182 and DSC 155. Completion of MATH 102 is encouraged but not required. Prerequisites: MATH 180A, and MATH 18 or MATH 31AH. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 183": "Introduction to probability. Discrete and continuous random variables–binomial, Poisson and Gaussian distributions. Central limit theorem. Data analysis and inferential statistics: graphical techniques, confidence intervals, hypothesis tests, curve fitting. (Credit not offered for MATH 183 if ECON 120A, ECE 109, MAE 108, MATH 181A, or MATH 186 previously or concurrently taken. Two units of credit offered for MATH 183 if MATH 180A taken previously or concurrently.) Prerequisites: MATH 20C or MATH 31BH, or consent of instructor.",
    "MATH 184": "Introduction to the theory and applications of combinatorics. Enumeration of combinatorial structures (permutations, integer partitions, set partitions). Bijections, inclusion-exclusion, ordinary and exponential generating functions. Renumbered from MATH 184A; credit not offered for MATH 184 if MATH 184A if previously taken. Credit not offered for MATH 184 if MATH 188 previously taken. If MATH 184 and MATH 188 are concurrently taken, credit only offered for MATH 188. Prerequisites: MATH 31CH or MATH 109. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 185": "Statistical analysis of data by means of package programs. Regression, analysis of variance, discriminant analysis, principal components, Monte Carlo simulation, and graphical methods. Emphasis will be on understanding the connections between statistical theory, numerical results, and analysis of real data. Recommended preparation: exposure to computer programming (such as CSE 5A, CSE 7, or ECE 15) highly recommended. Prerequisites: MATH 181A, or ECON 120B, and either MATH 18 or MATH 20F or MATH 31AH, and MATH 20C or MATH 31BH. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 186": "This course will cover discrete and random variables, data analysis and inferential statistics, likelihood estimators and scoring matrices with applications to biological problems. Introduction to Binomial, Poisson, and Gaussian distributions, central limit theorem, applications to sequence and functional analysis of genomes and genetic epidemiology. (Credit not offered for MATH 186 if ECON 120A, ECE 109, MAE 108, MATH 181A, or MATH 183 previously or concurrently. Two units of credit offered for MATH 186 if MATH 180A taken previously or concurrently.) Prerequisites: MATH 20C or MATH 31BH, or consent of instructor.",
    "MATH 187A": "An introduction to the basic concepts and techniques of modern cryptography. Classical cryptanalysis. Probabilistic models of plaintext. Monalphabetic and polyalphabetic substitution. The one-time system. Caesar-Vigenere-Playfair-Hill substitutions. The Enigma. Modern-day developments. The Data Encryption Standard. Public key systems. Security aspects of computer networks. Data protection. Electronic mail. Recommended preparation: basic programming experience. Renumbered from MATH 187. Students may not receive credit for both MATH 187A and MATH 187. Prerequisites: MATH 10A or MATH 20A. Students who have not completed listed prerequisite may enroll with consent of instructor.",
    "MATH 187B": "The object of this course is to study modern public key cryptographic systems and cryptanalysis (e.g., RSA, Diffie-Hellman, elliptic curve cryptography, lattice-based cryptography, homomorphic encryption) and the mathematics behind them. We also explore other applications of these computational techniques (e.g., integer factorization and attacks on RSA). Recommended preparation: Familiarity with Python and/or mathematical software (especially SAGE) would be helpful, but it is not required. Prerequisites: MATH 187 or MATH 187A and MATH 18 or MATH 31AH or MATH 20F. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 188": "A rigorous introduction to algebraic combinatorics. Basic enumeration and generating functions. Enumeration involving group actions: Polya theory. Posets and Sperner property. q-analogs and unimodality. Partitions and tableaux. Credit not offered for MATH 188 if MATH 184 or MATH 184A previously taken. If MATH 184 and MATH 188 are concurrently taken, credit only offered for MATH 188. Prerequisites: MATH 31CH or MATH 109 and MATH 18 or MATH 31AH and MATH 100A or 103A. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 189": "An introduction to various quantitative methods and statistical techniques for analyzing data—in particular big data. Quick review of probability continuing to topics of how to process, analyze, and visualize data using statistical language R. Further topics include basic inference, sampling, hypothesis testing, bootstrap methods, and regression and diagnostics. Offers conceptual explanation of techniques, along with opportunities to examine, implement, and practice them in real and simulated data. Prerequisites: MATH 18 or MATH 20F or MATH 31AH, and MATH 20C and one of BENG 134, CSE 103, ECE 109, ECON 120A, MAE 108, MATH 180A, MATH 183, MATH 186, or SE 125. Students who have not completed listed prerequisites may enroll with consent of instructor.",
    "MATH 190A": "An introduction to point set topology: topological spaces, subspace topologies, product topologies, quotient topologies, continuous maps and homeomorphisms, metric spaces, connectedness, compactness, basic separation, and countability axioms. Examples. Instructor may choose further topics such as Urysohn’s lemma, Urysohn’s metrization theorem. Formerly MATH 190. Students may not receive credit for MATH 190A and MATH 190. Prerequisites: MATH 31CH or MATH 140A or MATH 142A. Students who have not completed prerequisites may enroll with consent of instructor.",
    "MATH 190B": "An introduction to the fundamental group: homotopy and path homotopy, homotopy equivalence, basic calculations of fundamental groups, fundamental group of the circle and applications (for instance to retractions and fixed-point theorems), van Kampen’s theorem, covering spaces, universal covers. Examples of all of the above. Instructor may choose further topics such as deck transformations and the Galois correspondence, basic homology, compact surfaces. Prerequisites: MATH 190A. Students who have not completed the listed prerequisite may enroll with consent of instructor.",
    "MATH 191": "Topics to be chosen by the instructor from the fields of differential algebraic, geometric, and general topology. Prerequisites: MATH 190A or consent of instructor.",
    "MATH 193A": "Probabilistic Foundations of Insurance. Short-term risk models. Survival distributions and life tables. Introduction to life insurance. Prerequisites: MATH 180A or MATH 183, or consent of instructor.",
    "MATH 193B": "Life Insurance and Annuities. Analysis of premiums and premium reserves. Introduction to multiple life functions and decrement models as time permits. Prerequisites: MATH 193A or consent of instructor.",
    "MATH 194": "Introduction to the mathematics of financial models. Basic probabilistic models and associated mathematical machinery will be discussed, with emphasis on discrete time models. Concepts covered will include conditional expectation, martingales, optimal stopping, arbitrage pricing, hedging, European and American options. Prerequisites: MATH 20D, and either MATH 18 or MATH 20F or MATH 31AH, and MATH 180A. Students who have not completed listed prerequisites may enroll with consent of instructor. Students completing ECON 120A instead of MATH 180A must obtain consent of instructor to enroll.",
    "MATH 195": "Students will be responsible for and teach a class section of a lower-division mathematics course. They will also attend a weekly meeting on teaching methods. (Does not count toward a minor or major.) Prerequisites: consent of instructor.",
    "MATH 196": "A variety of topics and current research results in mathematics will be presented by guest lecturers and students under faculty direction. May be taken for P/NP grade only. Prerequisites: upper-division status.",
    "MATH 197": "An enrichment program which provides academic credit for work experience with public/private sector employers. After independently securing an internship with significant mathematical content, students will identify a faculty member to work with directly, discussing the mathematics involved. Faculty may require related readings and assignments as appropriate. May be taken for credit three times. Units may not be applied towards major graduation requirements. Prerequisites: permission of department.",
    "MATH 199": "Independent reading in advanced mathematics by individual students. Three periods. (P/NP grades only.) Prerequisites: permission of department.",
    "MATH 199H": "Honors thesis research for seniors participating in the Honors Program. Research is conducted under the supervision of a mathematics faculty member. Prerequisites: admission to the Honors Program in mathematics, department stamp.",
    "MATH 200A": "First course in graduate algebra. Topics may include group actions, Sylow theorems, solvable and nilpotent groups, free groups and presentations, semidirect products, polynomial rings, unique factorization, chain conditions, modules over principal ideal domains, rational and Jordan canonical forms, tensor products, projective and flat modules, Galois theory, solvability by radicals, localization, primary decomposition, Hilbert Nullstellensatz, integral extensions, Dedekind domains, Krull dimension. Prerequisites: graduate standing in MA75, MA76, MA77, MA80, MA81. All other students may enroll with consent of instructor.",
    "MATH 200B": "Second course in graduate algebra. Topics may include group actions, Sylow theorems, solvable and nilpotent groups, free groups and presentations, semidirect products, polynomial rings, unique factorization, chain conditions, modules over principal ideal domains, rational and Jordan canonical forms, tensor products, projective and flat modules, Galois theory, solvability by radicals, localization, primary decomposition, Hilbert Nullstellensatz, integral extensions, Dedekind domains, Krull dimension. Prerequisites: MATH 200A. Students who have not completed MATH 200A may enroll with consent of instructor.",
    "MATH 200C": "Third course in graduate algebra. Topics may include group actions, Sylow theorems, solvable and nilpotent groups, free groups and presentations, semidirect products, polynomial rings, unique factorization, chain conditions, modules over principal ideal domains, rational and Jordan canonical forms, tensor products, projective and flat modules, Galois theory, solvability by radicals, localization, primary decomposition, Hilbert Nullstellensatz, integral extensions, Dedekind domains, Krull dimension. Prerequisites: MATH 200B. Students who have not completed MATH 200B may enroll with consent of instructor.",
    "MATH 201A": "Recommended for all students specializing in algebra. Basic topics include categorical algebra, commutative algebra, group representations, homological algebra, nonassociative algebra, ring theory. May be taken for credit six times with consent of adviser as topics vary. Prerequisites: MATH 200C. Students who have not taken MATH 200C may enroll with consent of instructor.",
    "MATH 202A": "Introduction to algebra from a computational perspective. Groups, rings, linear algebra, rational and Jordan forms, unitary and Hermitian matrices, matrix decompositions, perturbation of eigenvalues, group representations, symmetric functions, fast Fourier transform, commutative algebra, Grobner basis, finite fields. Prerequisites: graduate standing or consent of instructor.",
    "MATH 202B": "Second course in algebra from a computational perspective. Groups, rings, linear algebra, rational and Jordan forms, unitary and Hermitian matrices, matrix decompositions, perturbation of eigenvalues, group representations, symmetric functions, fast Fourier transform, commutative algebra, Grobner basis, finite fields. Prerequisites: MATH 202A or consent of instructor.",
    "MATH 202C": "Third course in algebra from a computational perspective. Groups, rings, linear algebra, rational and Jordan forms, unitary and Hermitian matrices, matrix decompositions, perturbation of eigenvalues, group representations, symmetric functions, fast Fourier transform, commutative algebra, Grobner basis, finite fields. Prerequisites: MATH 202B or consent of instructor.",
    "MATH 203A": "Introduction to algebraic geometry. Topics chosen from: varieties and their properties, sheaves and schemes and their properties. May be taken for credit up to three times. Prerequisites: MATH 200C. Students who have not taken MATH 200C may enroll with consent of instructor.",
    "MATH 203B": "Second course in algebraic geometry. Continued exploration of varieties, sheaves and schemes, divisors and linear systems, differentials, cohomology. May be taken for credit up to three times. Prerequisites: MATH 203A. Students who have not taken MATH 203A may enroll with consent of instructor.",
    "MATH 203C": "Third course in algebraic geometry. Continued exploration of varieties, sheaves and schemes, divisors and linear systems, differentials, cohomology, curves, and surfaces. May be taken for credit up to three times. Prerequisites: MATH 203B. Students who have not taken MATH 203B may enroll with consent of instructor.",
    "MATH 204A": "First course in graduate-level number theory. Local fields: valuations and metrics on fields; discrete valuation rings and Dedekind domains; completions; ramification theory; main statements of local class field theory. Prerequisites: MATH 200C. Students who have not taken MATH 200C may enroll with consent of instructor.",
    "MATH 204B": "Second course in graduate-level number theory. Global fields: arithmetic properties and relation to local fields; ideal class groups; groups of units; ramification theory; adèles and idèles; main statements of global class field theory. Prerequisites: MATH 204A. Students who have not taken MATH 204A may enroll with consent of instructor.",
    "MATH 204C": "Third course in graduate-level number theory. Zeta and L-functions; Dedekind zeta functions; Artin L-functions; the class-number formula and generalizations; density theorems. Prerequisites: MATH 204B. Students who have not taken MATH 204B may enroll with consent of instructor.",
    "MATH 205": "Topics in algebraic and analytic number theory, such as: L-functions, sieve methods, modular forms, class field theory, p-adic L-functions and Iwasawa theory, elliptic curves and higher dimensional abelian varieties, Galois representations and the Langlands program, p-adic cohomology theories, Berkovich spaces, etc. May be taken for credit nine times. Prerequisites: graduate standing.",
    "MATH 206A": "Introduction to varied topics in algebraic geometry. Topics will be drawn from current research and may include Hodge theory, higher dimensional geometry, moduli of vector bundles, abelian varieties, deformation theory, intersection theory. Nongraduate students may enroll with consent of instructor. May be taken for credit six times with consent of adviser as topics vary. Prerequisites: graduate standing.",
    "MATH 206B": "Continued development of a topic in algebraic geometry. Topics will be drawn from current research and may include Hodge theory, higher dimensional geometry, moduli of vector bundles, abelian varieties, deformation theory, intersection theory. May be taken for credit three times with consent of adviser as topics vary. Prerequisites: MATH 206A. Students who have not completed MATH 206A may enroll with consent of instructor.",
    "MATH 207A": "Introduction to varied topics in algebra. In recent years, topics have included number theory, commutative algebra, noncommutative rings, homological algebra, and Lie groups. May be taken for credit six times with consent of adviser as topics vary. Prerequisites: MATH 200C. Students who have not completed MATH 200C may enroll with consent of instructor.",
    "MATH 208": "Various topics in algebraic geometry. May be taken for credit nine times. Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor. (S/U grade only.)",
    "MATH 209": "Various topics in number theory. Prerequisites: graduate standing or consent of instructor. (S/U grade only.)",
    "MATH 210A": "Complex variables with applications. Analytic functions, Cauchy’s theorem, Taylor and Laurent series, residue theorem and contour integration techniques, analytic continuation, argument principle, conformal mapping, potential theory, asymptotic expansions, method of steepest descent. Prerequisites: MATH 20D-E-F, 140A/142A, or consent of instructor.",
    "MATH 210B": "Linear algebra and functional analysis. Vector spaces, orthonormal bases, linear operators and matrices, eigenvalues and diagonalization, least squares approximation, infinite-dimensional spaces, completeness, integral equations, spectral theory, Green’s functions, distributions, Fourier transform. Prerequisites: MATH 210A or consent of instructor.",
    "MATH 210C": "Calculus of variations: Euler-Lagrange equations, Noether’s theorem. Fourier analysis of functions and distributions in several variables. Partial differential equations: Laplace, wave, and heat equations; fundamental solutions (Green’s functions); well-posed problems. Prerequisites: MATH 210B or consent of instructor. (S)",
    "MATH 211A": "Various topics in algebra. Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor. May be taken for credit nine times. (S/U grades only.)",
    "MATH 211B": "Various topics in group actions. Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor. May be taken for credit nine times. (S/U grades only.)",
    "MATH 212A": "Part one of a two-course introduction to the use of mathematical theory and techniques in analyzing biological problems. Topics include differential equations, dynamical systems, and probability theory applied to a selection of biological problems from population dynamics, biochemical reactions, biological oscillators, gene regulation, molecular interactions, and cellular function. May be coscheduled with MATH 112A. Recommended preparation: Probability Theory and Differential Equations. Prerequisites: graduate standing.",
    "MATH 212B": "Part two of a two-course introduction to the use of mathematical theory and techniques in analyzing biological problems. Topics include partial differential equations and stochastic processes applied to a selection of biological problems, especially those involving spatial movement such as molecular diffusion, bacterial chemotaxis, tumor growth, and biological patterns. May be coscheduled with MATH 112B. Recommended preparation: Probability Theory and Stochastic Processes. Prerequisites: MATH 212A and graduate standing.",
    "MATH 214": "Topics include random number generators, variance reduction, Monte Carlo (including Markov Chain Monte Carlo) simulation, and numerical methods for stochastic differential equations. Methods will be illustrated on applications in biology, physics, and finance. May be coscheduled with MATH 114. Recommended preparation: Probability Theory and basic computer programming. Prerequisites: graduate standing.",
    "MATH 216A": "This is the first course in a three-course sequence in mathematical methods in data science, and will serve as an introduction to the rest of the sequence. Topics include principal component analysis and the singular value decomposition, sparse representation, dictionary learning, the Johnson Lindenstrauss Lemma and its applications, compressed sensing, kernel methods, nearest neighbor searches, and spectral and subspace clustering. Some scientific programming experience is recommended. Prerequisites: graduate standing.",
    "MATH 216B": "This is the second course in a three-course sequence in mathematical methods in data science. Topics include analysis on graphs, random walks and diffusion geometry for uniform and non-uniform sampling, eigenvector perturbation, multi-scale analysis of data, concentration of measure phenomenon, binary embeddings, quantization, topic modeling, and geometric machine learning, as well as scientific applications. Some scientific programming experience is recommended. Prerequisites: MATH 216A. Students who have not completed MATH 216A may enroll with consent of instructor.",
    "MATH 216C": "This is the third course in the sequence for mathematical methods in data science. Topics include non-linear signal processing, compressed sensing and its extensions, phase retrieval, blind deconvolution, neural networks, non-convex optimization, and optimal transport distances. Some scientific programming experience is recommended. Prerequisites: MATH 216B. Students who have not completed MATH 216B may enroll with consent of instructor.",
    "MATH 217": "In recent years, topics have included applied complex analysis, special functions, and asymptotic methods. May be repeated for credit with consent of adviser as topics vary. Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor.",
    "MATH 218": "Various topics in the mathematics of biological systems. May be taken for credit nine times. Prerequisites: graduate standing. (S/U grades only.)",
    "MATH 220A-B-C": "Complex numbers and functions. Cauchy theorem and its applications, calculus of residues, expansions of analytic functions, analytic continuation, conformal mapping and Riemann mapping theorem, harmonic functions. Dirichlet principle, Riemann surfaces. Prerequisites: MATH 140A-B or consent of instructor.",
    "MATH 221A": "Introduction to varied topics in several complex variables. In recent years, topics have included formal and convergent power series, Weierstrass preparation theorem, Cartan-Ruckert theorem, analytic sets, mapping theorems, domains of holomorphy, proper holomorphic mappings, complex manifolds and modifications. May be taken for credit six times with consent of adviser as topics vary. Prerequisites: MATH 200A and 220C. Students who have not completed MATH 200A and 220C may enroll with consent of instructor.",
    "MATH 221B": "Continued development of a topic in several complex variables. Topics include formal and convergent power series, Weierstrass preparation theorem, Cartan-Ruckert theorem, analytic sets, mapping theorems, domains of holomorphy, proper holomorphic mappings, complex manifolds and modifications. May be taken for credit three times with consent of adviser as topics vary. Prerequisites: MATH 221A. Students who have not completed MATH 221A may enroll with consent of instructor.",
    "MATH 231A": "First course in graduate partial differential equations. Laplace, heat, and wave equations. Non-linear first order equations, including Hamilton-Jacobi theory. Sobolev spaces and initial/boundary value problems for linear elliptic, parabolic, and hyperbolic equations. Non-linear second order equations, including calculus of variations. Prerequisites: MATH 210B or 240C. Students who have not completed MATH 210B or 240C may enroll with consent of instructor.",
    "MATH 231B": "Second course in graduate partial differential equations. Laplace, heat, and wave equations. Non-linear first order equations, including Hamilton-Jacobi theory. Sobolev spaces and initial/boundary value problems for linear elliptic, parabolic, and hyperbolic equations. Non-linear second order equations, including calculus of variations. Prerequisites: MATH 231A. Students who have not completed MATH 231A may enroll with consent of instructor.",
    "MATH 231C": "Third course in graduate partial differential equations. Laplace, heat, and wave equations. Non-linear first order equations, including Hamilton-Jacobi theory. Sobolev spaces and initial/boundary value problems for linear elliptic, parabolic, and hyperbolic equations. Non-linear second order equations, including calculus of variations. Prerequisites: MATH 231B. Students who have not completed MATH 231B may enroll with consent of instructor.",
    "MATH 237A": "Introduction to varied topics in differential equations. In recent years, topics have included Riemannian geometry, Ricci flow, and geometric evolution. May be taken for credit six times with consent of adviser as topics vary. Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor.",
    "MATH 237B": "Continued development of a topic in differential equations. Topics include Riemannian geometry, Ricci flow, and geometric evolution. May be taken for credit three times with consent of adviser as topics vary. Prerequisites: MATH 237A. Students who have not completed MATH 237A may enroll with consent of instructor.",
    "MATH 240A": "First course in graduate real analysis. Abstract measure and integration theory, integration on product spaces. Lebesgue measure and integral, Lebesgue-Stieltjes integrals, functions of bounded variation, differentiation of measures. Locally compact Hausdorff spaces, Banach and Hilbert spaces, linear functionals. Lebesgue spaces and interpolation, elements of Fourier analysis and distribution theory. Prerequisites: graduate standing in MA75, MA76, MA77, MA80, MA81. All other students may enroll with consent of instructor.",
    "MATH 240B": "Second course in graduate real analysis. Abstract measure and integration theory, integration on product spaces. Lebesgue measure and integral, Lebesgue-Stieltjes integrals, functions of bounded variation, differentiation of measures. Locally compact Hausdorff spaces, Banach and Hilbert spaces, linear functionals. Lebesgue spaces and interpolation, elements of Fourier analysis and distribution theory. Prerequisites: MATH 240A. Students who have not completed MATH 240A may enroll with consent of instructor.",
    "MATH 240C": "Third course in graduate real analysis. Abstract measure and integration theory, integration on product spaces. Lebesgue measure and integral, Lebesgue-Stieltjes integrals, functions of bounded variation, differentiation of measures. Locally compact Hausdorff spaces, Banach and Hilbert spaces, linear functionals. Lebesgue spaces and interpolation, elements of Fourier analysis and distribution theory. Prerequisites: MATH 240B. Students who have not completed MATH 240B may enroll with consent of instructor.",
    "MATH 241A": "First course in graduate functional analysis. Locally convex spaces, weak topologies. Convexity and fixed point theorems. Banach algebras and C*-algebras. Operators on Hilbert spaces (bounded, unbounded, compact, normal). Spectral theory of operators, semigroups of operators. Fredholm theory. Prerequisites: MATH 240C. Students who have not completed MATH 240C may enroll with consent of instructor.",
    "MATH 241B": "Second course in graduate functional analysis. Locally convex spaces, weak topologies. Convexity and fixed point theorems. Banach algebras and C*-algebras. Operators on Hilbert spaces (bounded, unbounded, compact, normal). Spectral theory of operators, semigroups of operators. Fredholm theory. Prerequisites: MATH 241A. Students who have not completed MATH 241A may enroll with consent of instructor.",
    "MATH 242": "In recent years, topics have included Fourier analysis in Euclidean spaces, groups, and symmetric spaces. May be repeated for credit with consent of adviser as topics vary. Prerequisites: MATH 240C, students who have not completed MATH 240C may enroll with consent of instructor.",
    "MATH 243": "Various topics in functional analysis. May be taken for credit nine times. Prerequisites: graduate standing or consent of instructor. (S/U grades only.)",
    "MATH 245A": "Convex sets and functions, convex and affine hulls, relative interior, closure, and continuity, recession and existence of optimal solutions, saddle point and min-max theory, subgradients and subdifferentials. Recommended preparation: course work in linear algebra and real analysis. Prerequisites: graduate standing.",
    "MATH 245B": "Optimality conditions, strong duality and the primal function, conjugate functions, Fenchel duality theorems, dual derivatives and subgradients, subgradient methods, cutting plane methods. Prerequisites: MATH 245A or consent of instructor.",
    "MATH 245C": "Convex optimization problems, linear matrix inequalities, second-order cone programming, semidefinite programming, sum of squares of polynomials, positive polynomials, distance geometry. Prerequisites: MATH 245B or consent of instructor.",
    "MATH 247A": "Introduction to varied topics in real analysis. In recent years, topics have included Fourier analysis, distribution theory, martingale theory, operator theory. May be taken for credit six times with consent of adviser. Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor.",
    "MATH 247B": "Continued development of a topic in real analysis. Topics include Fourier analysis, distribution theory, martingale theory, operator theory. May be taken for credit three times with consent of adviser as topics vary. Prerequisites: MATH 247A. Students who have not completed MATH 247A may enroll with consent of instructor.",
    "MATH 248": "Various topics in real analysis. Prerequisites: graduate standing or consent of instructor. (S/U grade only.)",
    "MATH 250A-B-C": "Differential manifolds, Sard theorem, tensor bundles, Lie derivatives, DeRham theorem, connections, geodesics, Riemannian metrics, curvature tensor and sectional curvature, completeness, characteristic classes. Differential manifolds immersed in Euclidean space. Prerequisites: consent of instructor.",
    "MATH 251A-B-C": "Lie groups, Lie algebras, exponential map, subgroup subalgebra correspondence, adjoint group, universal enveloping algebra. Structure theory of semisimple Lie groups, global decompositions, Weyl group. Geometry and analysis on symmetric spaces. Prerequisites: MATH 200 and 250 or consent of instructor.",
    "MATH 256": "Various topics in Lie groups and Lie algebras, including structure theory, representation theory, and applications. Prerequisites: graduate standing or consent of instructor. (S/U grade only.)",
    "MATH 257A": "Introduction to varied topics in differential geometry. In recent years, topics have included Morse theory and general relativity. May be taken for credit six times with consent of adviser. Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor.",
    "MATH 257B": "Continued development of a topic in differential geometry. Topics include Morse theory and general relativity. May be taken for credit three times with consent of adviser. Prerequisites: MATH 257A. Students who have not completed MATH 257A may enroll with consent of instructor.",
    "MATH 258": "Various topics in differential geometry. May be taken for credit nine times. Prerequisites: graduate standing or consent of instructor. (S/U grade only.)",
    "MATH 259A-B-C": "Manifolds, differential forms, homology, deRham’s theorem. Riemannian geometry, harmonic forms. Lie groups and algebras, connections in bundles, homotopy sequence of a bundle, Chern classes. Applications selected from Hamiltonian and continuum mechanics, electromagnetism, thermodynamics, special and general relativity, Yang-Mills fields. Prerequisites: graduate standing in mathematics, physics, or engineering, or consent of instructor.",
    "MATH 260A": "Propositional calculus and first-order logic. Theorem proving, Model theory, soundness, completeness, and compactness, Herbrand’s theorem, Skolem-Lowenheim theorems, Craig interpolation. Prerequisites: graduate standing or consent of instructor.",
    "MATH 260B": "Theory of computation and recursive function theory, Church’s thesis, computability and undecidability. Feasible computability and complexity. Peano arithmetic and the incompleteness theorems, nonstandard models. Prerequisites: MATH 260A or consent of instructor.",
    "MATH 261A": "Introduction to the probabilistic method. Combinatorial applications of the linearity of expectation, second moment method, Markov, Chebyschev, and Azuma inequalities, and the local limit lemma. Introduction to the theory of random graphs. Prerequisites: graduate standing or consent of instructor.",
    "MATH 261B": "Introduction to probabilistic algorithms. Game theoretic techniques. Applications of the probabilistic method to algorithm analysis. Markov Chains and Random walks. Applications to approximation algorithms, distributed algorithms, online and parallel algorithms. MATH 261A must be taken before MATH 261B. Prerequisites: MATH 261A.",
    "MATH 261C": "Advanced topics in the probabilistic combinatorics and probabilistic algorithms. Random graphs. Spectral Methods. Network algorithms and optimization. Statistical learning. MATH 261B must be taken before MATH 261C. Prerequisites: MATH 261B.",
    "MATH 262A": "Introduction to varied topics in combinatorial mathematics. In recent years topics have included problems of enumeration, existence, construction, and optimization with regard to finite sets. Recommended preparation: some familiarity with computer programming desirable but not required. May be taken for credit six times with consent of adviser as topics vary.  Prerequisites: graduate standing. Nongraduate students may enroll with consent of instructor.",
    "MATH 262B": "Continued development of a topic in combinatorial mathematics. Topics include problems of enumeration, existence, construction, and optimization with regard to finite sets. Recommended preparation: some familiarity with computer programming desirable but not required. May be taken for credit three times with consent of adviser as topics vary. Prerequisites: MATH 262A. Students who have not completed MATH 262A may enroll with consent of instructor.",
    "MSED 290": "Survey of recent literature highlighting critical issues in science education research. Specific focus on research in biology education, chemistry education, and physics education. Theoretical perspectives and research methodology (both qualitative and quantitative) used to understand learning will be discussed. Prerequisites: admission to the Joint Doctoral Program in Mathematics and Science Education or a master’s degree in biology, chemistry/biochemistry, mathematics, or physics with consent of instructor.",
    "MSED 294": "In this course, the graduate student will teach or assist a teacher in a K–12 setting. The graduate student will have the mentorship of the classroom teacher as well as the supervision of an MSED faculty member. Prerequisites: admission to the Joint Doctoral Program in Mathematics and Science Education. (S/U grades only.)",
    "MSED 295": "Each practicum lasts five weeks and is designed to inform students about a faculty member’s research program. Assignment as a research assistant may be used as one practicum. This course should be taken during the first year. May be taken for credit three times. Prerequisites: admission to MSED Joint Doctoral Program. (S/U grades only.)",
    "MSED 296A": "The course is designed to cover several major themes in mathematics and science education. It will address theories and applications of cognition, teaching and learning, and curriculum, with particular emphasis on international perspectives. This is a three-quarter sequence. Prerequisites: admission to the Joint Doctoral Program in Mathematics and Science Education or a master’s degree in biology, chemistry/biochemistry, mathematics, or physics with consent of instructor.",
    "MSED 296B": "The course is designed to cover several major themes in mathematics and science education. It will address theories and applications of cognition, teaching and learning, and curriculum, with particular emphasis on international perspectives. This is a three-quarter sequence. Prerequisites: admission to the Joint Doctoral Program in Mathematics and Science Education or a master’s degree in biology, chemistry/biochemistry, mathematics, or physics with consent of instructor. MSED 296A must be taken before MSED 296B.",
    "MSED 296C": "The course is designed to cover several major themes in mathematics and science education. It will address theories and applications of cognition, teaching and learning, and curriculum, with particular emphasis on international perspectives. This is a three quarter sequence. Prerequisites: admission to the Joint Doctoral Program in Mathematics and Science Education or a master’s degree in biology, chemistry/biochemistry, mathematics, or physics with consent of instructor. MSED 296B must be taken before MSED 296C.",
    "MSED 297": "Study of special topics in mathematics or science education under direction of a faculty member. Prerequisites: consent of instructor.",
    "MAE 02": "An introduction to topics in aeronautical and astronautical engineering including aerodynamics, propulsion, flight mechanics, structures, materials, orbital mechanics, design, mission planning, and environments. General topics include historical background, career opportunities, engineering ethics, and professionalism. Prerequisites: none.",
    "MAE 03": "Introduction to design process through hands-on individual and team projects. Topics include 2D/3D CAD (drawing projections/isometrics, dimensioning), design problem identification, prototype fabrication techniques (shop skills, rapid prototyping), design process (concept generation/selection, risk reduction strategies, scheduling), learning from hardware performance (problem solving/redesign), teamwork. Use of components: fasteners, couplings, DC motors, oral/written communication with graphics. Program or materials fees may apply. Prerequisites: PHYS 2A or 4A. Enrollment restricted to BE 25, MC 25, MC 27, MC 29, and MC 30–34 majors only.",
    "MAE 05": "Introductory course for nonengineering majors. Use of computers in solving problems; applications from life sciences, physical sciences, and engineering. Students run existing computer programs and complete some programming in BASIC. Prerequisites: none.",
    "MAE 07": "(Cross-listed with SE 7.) Spatial visualization is the ability to manipulate 2-D and 3-D shapes in one’s mind. In this course, students will perform exercises that increase their spatial visualization skills. P/NP grades only. Students may not receive credit for SE 7 and MAE 7. Prerequisites: none.",
    "MAE 08": "Computer programming in MATLAB with elementary numerical analysis of engineering problems. Arithmetic and logical operations, arrays, graphical presentation of computations, symbolic mathematics, solutions of equations, and introduction to data structures. Prerequisites: MATH 20A and 20B or consent of instructor.",
    "MAE 11": "Fundamentals of engineering thermodynamics: energy, work, heat, properties of pure substances, first and second laws for closed systems and control volumes, gas mixtures. Application to engineering systems, power and refrigeration cycles, combustion. Renumbered from MAE 110A. Students may not receive credit for MAE 11 and MAE 110A. Prerequisites: PHYS 2C and CHEM 6A. Enrollment restricted to engineering majors only.",
    "MAE 20": "The structure of materials: metals, ceramics, glasses, semiconductors, superconductors, and polymers to produce desired, useful properties. Atomic structures. Defects in materials, phase diagrams, microstructural control. Mechanical and electrical properties are discussed. Time temperature transformation diagrams. Diffusion. Prerequisites: PHYS 2A or 4A, CHEM 6A or CHEM 6AH, and MATH 20C.",
    "MAE 21": "Atomic structure and physical properties of engineering materials including metals, ceramics, glasses, polymers, and composite materials. Defects and phase diagram of materials. Material testing and processing. Program or materials fees may apply. Prerequisites: PHYS 2A or 4A, CHEM 6A or CHEM 6AH, and MATH 20B. Enrollment restricted to MC 25 majors only.",
    "MAE 30A": "Statics: statics of particles and rigid bodies in 3-D. Free body diagrams. Moment of a force, couples, equivalent systems of forces. Distributed forces, centroids, and centers of gravity. Introduction to dynamics: 3-D relative motion, kinematics, and kinetics of particles. Newton’s equations of motion. Equilibrium problems with friction. Enrollment restricted to engineering majors MC 25, MC 27, MC 29, MC 30–34, and SE 27. Prerequisites: PHYS 2A and MATH 31BH or MATH 20C.",
    "MAE 30B": "Dynamics: energy methods for motion of particles and rigid bodies, including virtual work, power, and Lagrange’s equations. Impact and impulses. Systems of particles. Introduction to 3-D dynamics of rigid bodies. Introduction to vibrations: free and harmonically forced vibrations of undamped and damped single degree of freedom systems. Enrollment restricted to engineering majors only MC 25, MC 27, MC 29, MC 30–34, and SE 27. Prerequisites: MAE 30A.",
    "MAE 40": "Steady-state and dynamic behavior of linear, lumped-parameter electrical circuits. Kirchhoff’s laws. RLC circuits. Node and mesh analysis. Operational amplifiers. Signal acquisition and conditioning. Electric motors. Design applications in engineering. Prerequisites: MATH 20D and MATH 31AH or MATH 18 or MATH 20F, and PHYS 2B.",
    "MAE 87": "The First-year Student Seminar program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges. Topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students. Prerequisites: none.",
    "MAE 92A": "(Cross-listed with SE 10A.) Student teams design, build, and fly unmanned aircraft for a national student competition. Students concentrate on vehicle system design including aerodynamics, structures, propulsion, and performance. Teams engineering, fabricate the aircraft, submit a design report, and prep aircraft for competition. Prerequisites: consent of instructor.",
    "MUIR 1": "This course facilitates academic success at a leading research university by helping students understand and embrace academic and curricular expectations, engage and map cocurricular opportunities, and strengthen critical thinking and organizational, interpersonal, and wellness skills. P/NP grades only. Prerequisites: department approval. Open to incoming Muir College students only.",
    "MUIR 2": "This course facilitates academic success at a leading research university by helping students understand and embrace academic and curricular expectations, engage and map cocurricular opportunities, and strengthen critical thinking and organizational, interpersonal, and wellness skills. P/NP grades only. Prerequisites: department approval. Open to Muir College transfer students only.",
    "MUIR 199": "A course of independent work on a research or creative project to satisfy a Muir graduation requirement. (Only Muir students who have had Muir Special Project proposals approved may enroll in this course.) Students wishing to enroll must submit a written request with a description of the project. (Muir students must submit the Muir Special Project 199 form to the major advisor and to the Office of the Provost by the seventh week of the quarter prior to the quarter in which the 199 is to be undertaken. For information on other requirements, consult the provost’s office.) Prerequisites: upper-division status, approval by project advisor and by provost. (Letter grades only.)",
    "MCWP 40": "First course of sequence in university reading and writing which satisfies the Muir College graduation requirement in writing. Required of all Muir College first-year students and of transfer students who have not completed a comparable course elsewhere. MCWP 40 introduces students to the basic elements of argument and analysis. Students engage in close reading of texts, weekly writing and revision, and individual conferences. Course must be taken for a letter grade. Those who need additional work to prepare for MCWP 50 will be given a grade of IP and will be required to take MCWP 41. Prerequisites: satisfaction of the UC Entry Level Writing requirement.",
    "MCWP 50": "Second course of sequence in reading and writing which satisfies the Muir College graduation requirement in writing. Required of all Muir College first-year students and of transfer students. MCWP 50 focuses on advanced skills of argument and analysis. Students engage in close reading of texts, weekly writing and revision, and individual conferences. Course must be taken for a letter grade. Prerequisites: satisfaction of MCWP 40 requirement or completion of TAG or IGETC agreement.",
    "MCWP 125": "An advanced course in argumentation and analysis, with particular attention both to constructing arguments and analyzing the logic and rhetoric of others’ arguments. Students will engage in close reading of texts, weekly writing and revision, and individual conferences. A course specially designed for and required of transfer students who enter Muir College under the aegis of TAG or IGETC. Prerequisites: department approval.",
    "MUS 1A": "This course, first in a three-quarter sequence, is primarily intended for students without previous musical experience. It introduces music notation and basic music theory topics such as intervals, scales, keys, and chords, as well as basic rhythm skills. Prerequisites: none.",
    "MUS 1B": "This course, second in a three-quarter sequence, focuses on understanding music theory and in developing musical ability through rhythm, ear training, and sight singing exercises. Topics include major and minor scales, seventh-chords, transposition, compound meter and rudiments of musical form. Prerequisites: MUS 1A.",
    "MUS 1C": "This course, third in a three-quarter sequence, offers solid foundation in musical literacy through exercises such as harmonic and melodic dictation, sight singing exercises and rhythm in various meters. Topics include complex rhythm, harmony, and basic keyboard skills. Prerequisites: MUS 1B.",
    "MUS 2A-B-C": "Primarily intended for music majors. Development of basic skills: perception and notation of pitch and temporal relationships. Introduction to functional harmony. Studies in melodic writing. Drills in sight singing, rhythmic reading, and dictation. Prerequisites: passing score on proficiency exam. Must be taken in sequence. Music majors must be concurrently enrolled in MUS 2AK, 2BK, and 2CK (Basic Keyboard).",
    "MUS 2AK-BK-CK": "Scales, chords, harmonic progressions, transposition, and simple pieces. Prerequisites: concurrent enrollment in MUS 2A, B, C.",
    "MUS 2JK": "This course will acquaint students with basic concepts in jazz piano. Students will learn chord voicing, how to read a lead sheet, and modes for improvising. Major pianists from the idiom will be listened to and discussed. The course is ideal for non-pianists as well as pianists because its emphasis is theoretical, not technical. Prerequisites: MUS 2AK and 2BK or passing proficiency exam, or consent of instructor. Concurrent enrollment in MUS 2C. Majors only.",
    "MUS 4": "A brief survey of the history of Western music from the Middle Ages to the present. Much attention will be paid to the direct experience of listening to music and attendance of concerts. Class consists of lectures, listening labs, and live performances. Prerequisites: none.",
    "MUS 5": "An examination and exploration of the art and science of music making. Topics include acoustics, improvisation, composition, and electronic and popular forms. There will be required listening, reading, and creative assignments. No previous musical background required. Prerequisites: none.",
    "MUS 6": "Lectures and listening sessions devoted to the most significant works of music realized through the use of computers and other electronic devices from the middle of this century through the present. Prerequisites: none.",
    "MUS 7": "Exploration of the interactions among music, science, and technology, including the history and current development of science and technology from the perspective of music. Prerequisites: none.",
    "MUS 8": "Jazz is one of the primary foundations for American music in the twentieth and twenty-first centuries. This course highlights the multicultural and international scope of jazz by taking a thematic rather than a chronological approach to the subject, and by highlighting the music and lives of a diverse array of jazz practitioners from around the country and around the world. Students may not receive credit for both MUS 8 and MUS 8GS. Prerequisites: none. (Offered in selected years.)",
    "MUS 9": "This course will consist of lectures and listening sessions devoted to a detailed discussion of a selection of representative orchestral works (e.g., Mozart, Beethoven, Berlioz, Stravinsky, Ligeti, etc.). Prerequisites: none. (Offered in selected years.)",
    "MUS 11": "A course on folk music of the world, covered through lectures, films, and listening sessions devoted to detailed discussion of music indigenous to varying countries/areas of the world. Topics vary from year to year. May be repeated once for credit. Prerequisites: none.",
    "MUS 12": "A study of works from the history of opera to coincide when possible with operas presented in the San Diego opera season. Class consists of lectures, listening labs, live performances, and opera on video. Prerequisites: none.",
    "MUS 13": "Through surveying selected musical traditions and practices from around the world, this course explores the ways in which music both reflects and affects social, cultural, and ecological relationships. Specific case studies will be covered through lectures, films, and listening sessions. Prerequisites: none.",
    "MUS 14": "This course offers opportunities to prepare oneself for experiences with new music (through preview lectures), hear performances (by visiting or faculty artists), to discuss each event informally with a faculty panel: an effort to foster informed listening to the new in music. Prerequisites: none.",
    "MUS 15": "A course on popular music from different time periods, covered through lectures, films, and listening sessions. Topics vary from year to year. May be repeated once for credit. Prerequisites: none.",
    "MUS 16": "This course will explore The Beatles from musical, cultural, historical, technological, and critical angles. It will place them in context, examining their assorted confluences and wide influences. The group will be critically examined as artists, innovators, and public personalities. Listening, watching, and discussion will provide a broader, deeper, and more personal understanding of the group’s enduring appeal. Prerequisites: none.",
    "MUS 17": "This class presents a broad chronological overview of the development of hip-hop as a musical form from the late 1970s through today. It examines the development of the style in relation to direct context and to earlier African American musical and cultural forms and considers the technological and legal issues that have impacted its development. The class is listening intensive and students will be expected to know and recognize essential structures and production techniques. Prerequisites: none.",
    "MUS 18": "A survey of Eastern European Jewish folk music, Yiddish theatre and popular song, and their transition to America. Credit not allowed for MUS 18 and JUDA 18. (Cross-listed with JUDA 18.) Prerequisites: none.",
    "MUS 19": "Explores the lineage of electronic music’s Black pioneers, who have been integral but overlooked in the discussion around the creation and development of house, techno, drum and bass, and experimental music. These musics were developed with sociopolitical movements at the foundation of the sounds. We will investigate the African diaspora lens through the artists’ usage of science fiction, technology, and futurist ideologies. Prerequisites: none.",
    "MUS 20": "How do we transform complex sounds into comprehensible and meaningful music? What physiological, neurological, cognitive, and cultural systems are involved? Why do we make music in such diverse ways around the globe? Does music have evolutionary or ecological significance? What is the relationship between music, motion, and emotions? This course explores contemporary understandings of how we hear and how we become musical and invites students to listen to new music in new ways. Students may not receive credit for both MUS 20 and COGS 20. (Cross-listed with COGS 20.) Prerequisites: none.",
    "MUS 32": "Individual instruction on intermediate level in instrumental technique and repertory. For declared music majors and minors. Students must be simultaneously enrolled in a performance ensemble or nonperformance music course. May be taken six times for credit. Prerequisites: audition and department stamp.",
    "MUS 32G": "Group instruction in instrumental or vocal technique and repertory. Intermediate level. Intended for students who make an important contribution to Department of Music ensembles. Prerequisites: written recommendation of ensemble director and audition for performance faculty on first day of classes required. Department stamp required. May be taken for credit six times. (Offered in selected years.)",
    "MUS 32V": "Individual instruction on intermediate level in vocal technique and repertory. For declared music majors and minors. Students must be simultaneously enrolled in a performance ensemble or nonperformance music course and in MUS 32VM. May be taken six times for credit. Prerequisites: audition and department stamp.",
    "MUS 32VM": "All students enrolled in voice lessons (32V, 132V, or 132C) perform for one another and their instructors. Students critique in-class performances, with emphasis on presentation, diction, dramatic effect, vocal quality, and musicality. Prerequisites: concurrent enrollment in MUS 32V, 132V, or 132C.",
    "MUS 33A": "First course in a sequence for music majors and nonmajors pursuing an emphasis in composition. The course examines “sound” itself and various ways of building sounds into musical structures and develops skills in music notation. Students compose solo pieces in shorter forms. Students may not receive credit for both MUS 33 and 33A. Prerequisites: MUS 2C or consent of instructor.",
    "MUS 33B": "Second part of course sequence for students pursuing a composition emphasis. Course continues the building of skills with the organization of basic compositional elements: pitch, rhythm, and timbre. It explores issues of musical texture, expression, and structure in traditional and contemporary repertoire. Writing for two instruments in more extended forms. Prerequisites: MUS 33A.",
    "MUS 33C": "Third part of course sequence for students pursuing a composition emphasis. Course continues the development of skills in instrumentation and analysis. It includes a survey of advanced techniques in contemporary composition, with additional focus on notation, part-preparation, and the art of writing for small groups of instruments. Prerequisites: MUS 33B.",
    "NANO 4": "Introduction to NanoEngineering lab-based skills. Hands-on training and experimentation with nanofabrication techniques, integration, and analytical tools. This class is for NANO majors who are incoming first-year students, to be taken their first year. P/NP grades only. Prerequisites: department approval required.",
    "NANO 11": "Introduction to NanoEngineering, including fundamental scaling laws, and an overview of nanomaterials synthesis, properties, and relevant technological applications with focus in the area of nanomedicine, energy, and advanced materials. Prerequisites: NANO 4.",
    "PHYS 1A": "Second quarter of a three-quarter introductory physics course geared toward life-science majors. Electric fields, magnetic fields, DC and AC circuitry. PHYS 1B and 1BL are designed to be taken concurrently but may be taken in separate terms; taking the lecture before the lab is the best alternative to enrolling in both. Prerequisites: PHYS 1A or 2A, and MATH 10B or 20B.",
    "PHYS 1AL": "A calculus-based science-engineering general physics course covering vectors, motion in one and two dimensions, Newton’s first and second laws, work and energy, conservation of energy, linear momentum, collisions, rotational kinematics, rotational dynamics, equilibrium of rigid bodies, oscillations, gravitation. Students continuing to PHYS 2B/4B will also need MATH 20B. Students will not receive credit for both PHYS 2A and PHYS 2AR. Prerequisites: MATH 10A-B or 20A or 20B or 20C or 31BH. Recommended preparation: prior or concurrent enrollment in MATH 20B.",
    "PHYS 1B": "A calculus-based science-engineering general physics course covering vectors, motion in one and two dimensions, Newton’s first and second laws, work and energy, conservation of energy, linear momentum, collisions, rotational kinematics, rotational dynamics, equilibrium of rigid bodies, oscillations, gravitation. This course is a distance education course. Students continuing to PHYS 2B/4B will also need MATH 20B. Students will not receive credit for both PHYS 2AR and PHYS 2A. Prerequisites: MATH 10A-B or 20A or 20B or 20C or 31BH. Recommended preparation: prior or concurrent enrollment in MATH 20B.",
    "PHYS 1BL": "Experiments include gravitational force, linear and rotational motion, conservation of energy and momentum, collisions, oscillations and springs, gyroscopes. Data reduction and error analysis are required for written laboratory reports. One hour lecture and three hours laboratory. Prerequisites: PHYS 2A or 4A. Recommended preparation: prior or concurrent enrollment in PHYS 2B or 4C.",
    "PHYS 1C": "Experiments on L-R-C circuits; oscillations, resonance and damping, measurement of magnetic fields. One hour lecture and three hours laboratory. Program or materials fee may apply. Prerequisites: PHYS 2A or 4A, and 2B or 4C. Recommended preparation: prior or concurrent enrollment in PHYS 2C or 4D.",
    "PHYS 1CL": "A modern physics course covering atomic view of matter, electricity and radiation, atomic models of Rutherford and Bohr, relativity, X-rays, wave and particle duality, matter waves, Schrödinger’s equation, atomic view of solids, natural radioactivity. Prerequisites: PHYS 2A or 4A, 2B, and MATH 20D. Recommended preparation: prior or concurrent enrollment in MATH 20E.",
    "PHYS 2A": "Experiments to be chosen from refraction, diffraction and interference of microwaves, Hall effect, thermal band gap, optical spectra, coherence of light, photoelectric effect, e/m ratio of particles, radioactive decays, and plasma physics. One hour lecture and three hours laboratory. Program or materials fees may apply. Prerequisites: PHYS 2BL or 2CL. Recommended preparation: prior or concurrent enrollment in PHYS 2D or 4E.",
    "PHYS 2AR": "The first quarter of a five-quarter calculus-based physics sequence for physics majors and students with a serious interest in physics. The topics covered are vectors, particle kinematics and dynamics, work and energy, conservation of energy, conservation of momentum, collisions, rotational kinematics and dynamics, equilibrium of rigid bodies, small oscillations, gravitation, and central force motion. Prerequisites: MATH 20A. Recommended preparation: prior or concurrent enrollment in MATH 20B and a knowledge of vectors.",
    "PHYS 2B": "Continuation of PHYS 4A covering forced and damped oscillations, fluid statics and dynamics, waves in elastic media, sound waves, heat and the first law of thermodynamics, kinetic theory of gases, Brownian motion, Maxwell-Boltzmann distribution, second law of thermodynamics. Students continuing to PHYS 4C will also need MATH 18 or 20F or 31AH. Prerequisites: PHYS 4A and MATH 20A-B. Recommended preparation: prior or concurrent enrollment in MATH 20C or 31BH.",
    "PHYS 2BL": "Continuation of PHYS 4B covering charge and Coulomb’s law, electric field, Gauss’s law, electric potential, capacitors and dielectrics, current and resistance, magnetic field, Ampere’s law, Faraday’s law, inductance, AC circuits. Prerequisites: PHYS 4A-B, MATH 20A-B-C or 31BH, and 18 or 20F or 31AH. Recommended preparation: prior or concurrent enrollment in MATH 20E or 31CH.",
    "PHYS 2C": "Continuation of PHYS 4C covering electric and magnetic fields in matter, Maxwell’s equations and electromagnetic waves, special relativity and its applications to electromagnetism, optics, interference, diffraction. Prerequisites: PHYS 4A-B-C, MATH 20A-B-C or 31BH, 20E or 31CH, and 18 or 20F or 31AH. Recommended preparation: prior or concurrent enrollment in MATH 20D.",
    "REV 1": "This course facilitates academic success at a leading research university by helping students understand and embrace academic and cocurricular expectations, engage and map cocurricular opportunities, and strengthen critical thinking and organizational, interpersonal, and wellness skills. P/NP grades only. Prerequisites: open to Revelle College first-year students only. (F)",
    "REV 2": "This course facilitates academic success at a leading research university by helping students understand and embrace academic and curricular expectations, engage and map cocurricular opportunities, and strengthen critical thinking and organizational, interpersonal, and wellness skills. P/NP grades only. Prerequisites: open to Revelle College transfer students only. (F)",
    "REV 12": "Weekly seminars with a faculty member for Revelle undergraduates interested in the science of mindfulness and how to use it for stress management, interpersonal skills, performance improvement, and to increase the sense of well-being. P/NP grades only. Prerequisites: open to Revelle undergraduate students only. (S)",
    "REV 16": "This weekly class is for all Revelle undergraduate levels seeking to connect leadership theory to practice while exploring how leadership can be exercised in classrooms, communities, and a variety of career pathways. P/NP grades only. Prerequisites: enrollment limited to Revelle College students. (W)",
    "REV 20": "Weekly seminars with a faculty member (chosen each year by the provost to match the interests of participating students). This seminar will acquaint students coming from high schools (first-year students) with the scholarship and research being conducted by faculty and instill in students a sense of participation in the scholarly life at UC San Diego. P/NP grades only. Prerequisites: by invitation only. (F,W,S)",
    "SIO 1": "Space exploration has revealed an astonishing diversity among the planets and moons in our solar system. The planets and their histories will be compared to gain insight and a new perspective on planet Earth. Prerequisites: none.",
    "SIO 3": "An introduction to the wide variety of organisms that live in the oceans, the habitats they occupy, and how species interact with each other and their environment. Included will be examinations of adaptations, behavior, ecology, and a discussion of local and global resource management and conservation issues. This course is designed for nonbiology majors. Prerequisites: none.",
    "SIO 10": "An introduction to structure of the Earth and the processes that form and modify it. Emphasizes material that is useful for understanding geological events as reported in the news and for making intelligent decisions regarding the future of our environment. Prerequisites: none.",
    "SIO 10GS": "This Global Seminar course will provide an introduction to planet Earth and the processes that shape it. Topics to be covered include Earth layers, materials, plate tectonics, weathering and erosion, and coastal processes. The geology of Iceland will be a specific emphasis and will thus be used as a lens through which to learn about the Earth. Program or material fee may apply. Prerequisites: students must apply and be accepted to the Global Seminars Program.",
    "SIO 12": "Evolution of the Earth from its origin in the early solar system to formation of continents and ocean basins, and how the planet became habitable. It examines the geologic record of evolution, extinction, plate tectonics, and climate changes through time. Prerequisites: none.",
    "SIO 15": "Introduction to environmental perils and their impact on everyday life. Geological and meteorological processes, including earthquakes, volcanic activity, large storms, global climate change, mass extinctions throughout Earth’s history, and human activity that causes and prevents natural disasters. Prerequisites: none.",
    "SIO 16": "An introduction to fundamental concepts of geology and environmental science through the lens of the national park system. Topics covered include the geologic time scale; plate tectonics; igneous, metamorphic, and sedimentary processes; geomorphology; climate change; and environmental degradation. Prerequisites: none.",
    "SIO 20": "Descriptive introduction to meteorology and climate studies. Topics include global and wind and precipitation patterns, weather forecasting, present climate and past climate changes (including droughts, El Niño events), greenhouse gas effects, ozone destruction, the “little ice age,” acid rain. Prerequisites: none.",
    "SIO 25": "Climate change is one of the most complex and critical issues affecting societies today. This course will present the scientific evidence for climate change and its impacts and consider governmental policy responses and possible adaptation strategies. Prerequisites: none.",
    "SIO 30": "Presents modern ideas and descriptions of the physical, chemical, biological, and geological aspects of oceanography, and considers the interactions between these aspects. Intended for students interested in the oceans, but who do not necessarily intend to become professional scientists. Prerequisites: none.",
    "SIO 35": "This course will examine the properties of water that make it unique and vital to living things. Origin of water on Earth and neighboring planets will be explored. Socially relevant issues concerning water use and contamination will be covered. Prerequisites: none.",
    "SIO 40": "Explores life on Earth and its relationship to the environment—past, present, and future. Topics include origins of life, earth history, elemental cycles, global climate variability and human impacts on our environment. Prerequisites: none.",
    "SIO 45": "This class will provide students with an introduction to volcanoes, including the mechanisms, products, and hazards associated with various types of volcanic eruptions. A key area of emphasis will be the impact of volcanism on human societies. Prerequisites: none.",
    "SIO 45GS": "This class will provide students with an introduction to volcanoes, including the mechanisms, products, and hazards associated with various types of volcanic eruptions. A key area of emphasis will be the impact of volcanism on human societies. Prerequisites: students must apply for and be accepted to the Global Seminars Program.",
    "SIO 46GS": "This global seminar course will focus on European volcanism—past, present, and future. Students will learn in detail about the volcanoes of Europe, including their geologic origins, eruptive styles, and histories. A special focus will be on the impact of volcanic hazards on the people, cultures, and societies of this heavily populated region. Notable volcanoes and historical eruptions (Vesuvius and Pompeii, Mt. Etna, Santorini, Campi Flegrei) will be discussed in detail. Program or materials fees may apply. Prerequisites: students must apply for and be accepted to the Global Seminars Program.",
    "SIO 50": "This course is an introduction to how our planet works, focusing on the formation and evolution of the solid earth, and the processes affecting both its surface and interior. Laboratories and substantial field component complement and extend the lecture material. Program and/or materials fees may apply. Prerequisites: none.",
    "SIO 60": "Oceanic and atmospheric sciences are introduced through a series of modules where students learn basic principles in the classroom and then have hands-on experiences demonstrating these principles. The course will include trips to the beach, the Ellen Browning Scripps Memorial Pier, and laboratories at Scripps Institution of Oceanography. Prerequisites: none.",
    "SIO 65": "This seminar introduces students to the field of geoscience and to the concentration options within the geosciences major. During the seminar, students will explore options for study, career opportunities, and contemporary topics while building relationships with their peers in the cohort. Presentations and talks will feature a variety of subjects, including discussions by industry experts. Prerequisites: none. (P/NP grades only).",
    "SIO 75": "An introduction to geologic time and the history of the Earth. Topics include physical, biological, and climate history of Earth, measurement of geologic time, formation of major Earth features, change in the Earth system, and North American geology. Prerequisites: SIO 50 or consent of instructor.",
    "SEV 20": "This course introduces students to UC San Diego’s vibrant intellectual community through weekly seminars and field trips led by UC San Diego faculty and other invited speakers, who will discuss their path-breaking research and other exciting artistic and scientific endeavors taking place on campus and in the surrounding community. Prerequisites: department approval required. May be taken for credit up to three times.",
    "SEV 195": "Students, under the direction of the instructor, lead discussion sections, attend lectures, and meet regularly with the instructor to help prepare course materials. Prerequisites: department approval required.",
    "SEV 500": "This course, designed for graduate students serving as teaching assistants in Seventh College courses, provides training in teaching methods, classroom management, and evaluation/grading. Prerequisites: department approval required. Students will have an application process for this course.",
    "SYN 1": "Synthesis 1 asks students to critically examine through an interdisciplinary and antiracist lens how we communicate about the climate crisis in order to address the question of how we get people to respond and take action. Through a variety of assignments and activities, students develop an awareness of both the message of a text and how the author crafted that message. They learn how to assess the purpose, audience, and context of different rhetorical situations. Prerequisites: Seventh College students only, completion of UC Entry Level Writing requirement, must be taken for a letter grade to count toward Seventh College general-education requirements. Duplicate credit with SYN 1R.",
    "SYN 1R": "Synthesis 1R asks students to critically examine through an interdisciplinary and antiracist lens how we communicate about the climate crisis in order to address the question of how we get people to respond and take action. Through a variety of assignments and activities, students develop an awareness of both the message of a text and how the author crafted that message. They learn how to assess the purpose, audience, and context of different rhetorical situations. Prerequisites: Seventh College students only, completion of UC Entry Level Writing requirement, must be taken for a letter grade to count toward Seventh College general-education requirements. Duplicate credit with SYN 1.",
    "SYN 2": "Synthesis 2 builds upon the skills developed in Synthesis 1. In the first half of the quarter, students learn the links between climate change and racial justice. Using an antiracist framework, students work in a small group to research an aspect of the climate crisis. In the second half of the quarter, students are introduced to project design and learn how to draft a proposal. Students learn how to determine the scope of a project based on such criteria as time, money, and potential impact. Prerequisites: Seventh College students only, SYN 1/SYN 1R, must be taken for a letter grade to count toward Seventh College general-education requirements. Duplicate credit with SYN 2R.",
    "SYN 2R": "Synthesis 2 builds upon the skills developed in Synthesis 1. In the first half of the quarter, students learn the links between climate change and racial justice. Using an antiracist framework, students work in a small group to research an aspect of the climate crisis. In the second half of the quarter, students are introduced to project design and learn how to draft a proposal. Students learn how to determine the scope of a project based on such criteria as time, money, and potential impact. Prerequisites: Seventh College students only, SYN 1/SYN 1R, must be taken for a letter grade to count toward Seventh College general-education requirements. Duplicate credit with SYN 2.",
    "SYN 100": "SYN 100 is a project-based course that builds upon foundational skills by taking a collaborative, interdisciplinary approach to complex global problems. Each section focuses on a different theme, challenge, or question related to the climate crisis. Despite the different class topics, all students will learn by designing and executing a team project that addresses their section’s theme. Prerequisites: restricted to Seventh College students only, upper-division standing, completion of SYN 1/1R and 2/2R, must be taken for a letter grade to count toward Seventh College general-education requirements.",
    "SYN 150": "SYN 150 is recommended for Seventh College transfer students in preparation for SYN 100. Students critically examine, through an interdisciplinary and antiracist lens, key issues impacting our changing planet. Prerequisites: restricted to Seventh College transfer students only, must be taken for a letter grade to count toward Seventh College high-impact requirement, cannot be taken concurrently or after SYN 100.",
    "SYN 199": "Independent study designated for Seventh College students who wish to carry out a project they begin in previous synthesis program courses. Prerequisites: completion of SYN 100, restricted to upper-division Seventh College students only, must be taken P/NP only, can be taken up to two times for credit, must complete at least ninety units with a 2.5 GPA in upper-division undergraduate courses at UC San Diego, department approval is required, enrollment satisfies the Seventh College high-impact requirement.",
    "SYN 500": "Consideration and development of key changing planet topics and pedagogical methods appropriate to undergraduate teaching in the interdisciplinary Synthesis Program writing courses, under the supervision of the program director. May be taken for credit up to eighteen times. Prerequisites: department approval required.",
    "VIS 1": "An introduction to the concepts and techniques of two-dimensional art making with an emphasis on drawing. Lectures and studio classes will introduce skills and concepts of contemporary drawing practice in relation to a variety of genres such as illustration, comics, advertising, animation, and other forms of visualization. This course is offered only one time each year. Prerequisites: none.",
    "VIS 2": "An introduction to art making utilizing the transaction between people, objects, situations, and media. Includes both critical reflection on relevant aspects of modern and contemporary art practices (Marina Abramovic, Allen Kaprow, Adrian Piper, James Luna, Stelarc, Ron Athey, conceptual art, performance art, new media art, etc.) and practical experience in a variety of artistic exercises. This course is offered only one time each year. Prerequisites: none.",
    "VIS 3": "An introduction to art making that uses as its base the idea of the “conceptual.” The lecture exists as a bank of knowledge about various art world and nonart world conceptual plays. The studio section attempts to incorporate these ideas into individual and group projects using any “material.” This course is offered only one time each year. Prerequisites: none.",
    "VIS 6": "We will look at works that present androids, cyborgs, and AI as an emergent “other” in media. Examining science fiction films and media, students look critically at how race and gender are represented. Through the lens of feminist and antiracist scholarship, the course presents critical understandings of android/AI stories and their cultural implications. Special emphasis throughout the course will be placed on how such stories remake troubling histories and anxieties about race and gender. Prerequisites: none.",
    "VIS 7": "Looking at spectacle in motion pictures, the illusion of cinema, and visual effects in popular media. This class will introduce students to the history of special and visual effects in film and video, from the earliest cinematic experiments to experimental film and modern-day blockbusters. We will examine the integration of technology with image-making and storytelling and look at the exciting ways artists make the impossible come alive on screen. Prerequisites: none.",
    "VIS 8": "This seminar introduces students, with an academic background in critical theories of race and ethnicity, to artistic production in the visual arts. It combines practice-based research with theoretical and historical readings of works by scholars, artists, and filmmakers of the African diaspora. Prerequisites: AAS 10.",
    "VIS 9": "This course is a general study of the camera and photography utilizing digital technology. Emphasis is placed on developing fundamental manual control, understanding composition, and basic photographic techniques through lectures and field exercises. Prerequisites: none.",
    "VIS 10": "Designed around presentations by visiting artists, critics, and scientists involved with contemporary issues related to computer arts and design. Lectures by the instructor and contextual readings provide background material for the visitor presentations. Program or materials fees may apply. Students may not receive credit for both VIS 10 and ICAM 110. This course is offered only one time each year. Prerequisites: none.",
    "VIS 11": "This course examines the significant topics in art practice, theory, and history that are shaping contemporary art thinking. A wide range of media extending across studio art practice, digital media, performative practices, and public culture will be considered as interrelated components. This course is offered only one time each year during winter quarter. Prerequisites: none.",
    "VIS 20": "This course examines the history of Western art and architecture through such defining issues as the respective roles of tradition and innovation in the production and appreciation of art; the relation of art to its broader intellectual and historical contexts; and the changing concepts of the monument, the artist, meaning, style, and “art” itself. Representative examples will be selected from different periods, ranging from antiquity to modern. Content will vary with the instructor. Prerequisites: none.",
    "VIS 21A": "Course offers a comparative and thematic approach to the artistic achievements of societies with widely divergent structures and political organizations from the ancient Americas to Africa and the Pacific Islands. Topics vary with the interests and expertise of instructor. Students may not receive credit for VIS 21 and VIS 21A. Prerequisites: none.",
    "VIS 21B": "Survey of the major artistic trends of India, China, and Japan, taking a topical approach to important developments in artistic style and subject matter to highlight the art of specific cultures and religions. Students may not receive credit for VIS 21 and VIS 21B. Prerequisites: none.",
    "VIS 21C": "Survey of the major artistic trends of Africa, taking a topical approach to important developments in artistic style and subject matter to highlight the art of specific cultures, nations, and religions. Prerequisites: none.",
    "VIS 22": "A wide-ranging survey introducing the key aspects of global art and criticism in the nineteenth and twentieth centuries. The course will comparatively examine formations of modernism and modernity within and across a variety of aesthetic traditions in Africa, Asia, Europe, Latin America, North America, and Oceania. Prerequisites: none.",
    "VIS 23": "This course, a lower-division seminar for art history majors, covers the research tools and fundamental skills needed for advanced work in the field. Topics include descriptive and analytical writing; revision and peer review; compiling annotated bibliographies with traditional and online resources, indexes, and databases; evaluating source materials (including those found online); defining research programs; and preparing and delivering art history presentations. Prerequisites: none. Art history majors only."
}